{
  "page_number": 24,
  "title": "Surrender Series",
  "content": "# Surrender Series\n\n1:53 - 2:00Transition“Draw your knees into your chest, Roll up to a seat, Extend your legs with a slight bend in your knees, Inhale...”ExhaleSeated Forward Fold - Paschimottanasana2-3 BTransition“Slowly lower onto your back, Inhale bend your knees...”ExhaleHappy Baby Pose - Ananda Balasana2-3 BTransition“Pull your right knee to your chest, Extend your left leg long, Inhale...”ExhaleSupine Twist - Jathara Parivartanasana2-3 BTransition“Pull your left knee to your chest, Extend your right leg long, Inhale...”ExhaleSupine Twist - Jathara Parivartanasana2-3 BTransition“Hug your knees into your chest, Inhale...”ExhaleCorpse Pose - SavasanaTransition“Reach your arms and legs long, Roll to either side...”BreatheFetal PositionTransition“Draw your knees in toward your chest, Press up to a seat...”2-3 BInhaleDraw your thumbs to third eye center1 BExhaleBow forward “Namaste”1 B\n\n---\n[← Prev](/pages/page-063.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-065.md)\n\n# Page 65\n\nIntegrateyourmind,bodyandfocus on the matIntroduceanddefine yourbreathWarmupyourspinewithflexionandextension CalmyournervoussystemOfferChild’sPoseasarestingposture Offer adjustmentsandassists\nINTELLIGENT SEQUENCING The Yoga Flow Yoga C1 Sequence is designed to give our students a well rounded introductory yoga experiencein 60 minutes. The intention and order of the postures hold within themmany of the fundamental lessons onintelligent yoga sequencing. By drawing our attention to its intelligent order,we can better teach the poses as well as set a foundation for future yogasequences.As you dive into each series, consider why each pose comes next in the sequence.\n\n---\n[← Prev](/pages/page-064.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-066.md)\n\n# 3 .15 Integration Series\n\n3 .15 Integration Series\nChild’s Pose BalasanaEXHALE Downward Facing Dog Adho Mukha SvanasanaEXHALE Ragdoll Uttanasana\n\n---\n[← Prev](/pages/page-065.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-067.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n3 .16 © Yoga Flow YOGA BPC Child’s PoseBalasana[ buh-LA-suh-nuh ]What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-066.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-068.md)\n\n# PERSONALIZE YOUR PRACTICE Depth \\| Angle \\| Prop \\| PoseEMBRYO POSE\n\n3 .17 CUES Verb » Your » Body Part » Direction// FEET + LEGS Guide your knees a comfortable distance apartBring your big toes to touch // PELVIS + SPINE Bring your hips toward your heels Send your tailbone backLengthen your spine// ARMS + HEAD Reach your arms forward Spread your fingers wideRest your forehead on the matPress your hands into the mat to activate your shoulders*Launch your ThemeBENEFITS Lengthens and relaxes the muscles on the backline of your body. Relaxes your mind and nervous system.\nPROVIDE THE AB Cs IN CHILD POSE AssistsListen for cues, watch for demos, and have a clear method for asking for consent for assistsBreathActivate your Ujjayi breath. Seal your lips and breathe through your nose while gently hugging the muscles in the back of your throat CareEncourage self-care and return to Child’s Pose to reconnect to breath as needed\nBring your knees together Gaze right/leftReach your arms back\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | PoseEMBRYO POSE\n\n---\n[← Prev](/pages/page-067.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-069.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nDownward Facing Dog PoseAdho Mukha Svanasana[ udd-ho-mook-huh shwa-NA-suh-nuh]EXHALE\nBPC// TRANSITION“Inhale Table Top...”What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-068.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-070.md)\n\n# 3 .19\n\n3 .19\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Step your feet hips width distance Align your heels behind your ankles Place a small bend in your kneesBendyourkneestoeasesensationinyourlegs// PELVIS + SPINE Send your hips back and up Engage your abdominalsPull your front ribs in// ARMS + HEAD Place your hands shoulder width distance Spread your fingers widePress your thumbs and forefingers into the mat Bring your gazebackRotate your elbow creases towards your thumbs to broaden your upper back\nOPTIONS BendyourkneesShortenorwidenyourstanceLOOK FOR RoundedupperbackHyperextendedarmsForeheadtomatBENEFITS Lengthens and relaxes the muscles on the backline of your body. Relaxes your mind and nervous system.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-069.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-071.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n// TRANSITION“Inhale look forward,Exhale Ragdoll, walk to the top of your mat...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-070.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-072.md)\n\n# 3 .21\n\n3 .21\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Step your feet hips width distance Align your heels behind your ankles Place a small bend in your knees// PELVIS + SPINE Hang your torso over your thighs Send your tailbone upLengthen your spineRelax your torso towards your thighs to lengthen your spine// ARMS + HEAD Interlace your arms Relax your neckBring your gaze back\nOPTIONS Bend your kneesLOOK FOR Rounded upper backHips behind heels and feet togetherBENEFITS Lengthens and relaxes the muscles on the backline of your body. Relaxes your mind and nervoussystem.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-071.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-073.md)\n\n# Page 73\n\n3 .22 © Yoga Flow YOGA Identify neutral alignmentIntroduce a themeInvite students to set an intention\nWHAT IS A THEME? A theme can complete a class experience and create a mind body experience. Themes are universal and connect the physical practice and postures to life beyond the physical. One word or short phrase that is consistent through the practice may be explained in many different wayswith theme-inspired verbs, cues, metaphors or imagery. Choose a philosophical learning or a learning that is present to you.\n\n---\n[← Prev](/pages/page-072.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-074.md)\n\n# 3 .23 Intention Series\n\n3 .23 Intention Series\nEXHALE Stand at Attention Samasthiti\n\n---\n[← Prev](/pages/page-073.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-075.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nStand at AttentionSamasthiti[ suh-muh-sthee-teeh-hee]EXHALE\n// TRANSITION“Release your fingertipsto the mat, Toe-heel your feet together,Inhale rollyourself up to standing...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-074.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-076.md)\n\n# 3 .25\n\n3 .25\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bring your big toes to touchPress the four corners of your feet down Engage your legs// PELVIS + SPINE Engage your abdominals Draw your tailbone down Lift your chest up// ARMS + HEAD Bring your hands to heart centerDraw your shoulder blades together down your back Lengthen your neckLift the crown of your head up to lengthen your spine\nOPTIONS Bring your feet to hips width distanceLOOK FOR Shoulders upSway in low backBENEFITS Teaches your body to behave as a whole. Your large trunk and leg muscles generate power while small extremitymuscles refine that power. Encourages grounding in the present and mental courage to face challenges.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-075.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-077.md)\n\n# Page 77\n\n3 .26 © Yoga Flow YOGA Introduce vinyasa ChaturangaIntroduce foundational poses and cuesContinue to warm up the spine with flexion and extension Introduce flow and establish rhythmBuild internal heat\nVINYASA Vinyasa is a three-part Sanskrit word: ”vi” and “ny” and “asa” can be translated to mean “placement in a specific way” or to “place in a special way.” Vinyasa or vinyasa krama is intentional placement and sequencing of postures. One example is the placement of postures based on their similarities: Mountain Pose followed by Forward Fold both share leg orientation. Another is the placement of postures based on their breath: inhale postures followed by exhale postures.\n\n---\n[← Prev](/pages/page-076.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-078.md)\n\n# 3 .27 Sun Salutation A\n\n3 .27 Sun Salutation A\nINHALE Mountain Pose TadasanaEXHALE Standing Forward Fold UttanasanaINHALE Halfway Lift Ardha UttanasanaEXHALE High to Low Plank Chaturanga Dandasana INHALE Upward Facing Dog Urdhva Mukha Svanasana EXHALE Downward Facing Dog Adho Mukha Svanasana\n\n---\n[← Prev](/pages/page-077.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-079.md)\n\n# Page 79\n\nMountain PoseTadasanaor UtthitaHastasana[ tuh-DA-suh-nuh]INHALE\nBPC// TRANSITION“Open your eyes, Release your armsdown...”What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS[ oot-tee-tuhhuh-STA-suh-nuh]\n\n---\n[← Prev](/pages/page-078.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-080.md)\n\n# 3 .29\n\n3 .29\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Re-engage your legsSpread your toes widePress the four corners of your feet down// PELVIS + SPINE Engage your abdominals Draw your tailbone down Lift your chest up// ARMS + HEAD Reach your arms up, rotate your palms in and shoulder blades forwardDraw the inner border of your shoulder blades down Keep your gaze forwardRotate your triceps forward to broaden your upper back\nOPTIONS Bring your feet to hips width distanceLOOK FOR Shoulders upSway in low backBENEFITS Teaches your body to behave as a whole. Your large trunk and leg muscles generate power while small extremitymuscles refine that power. Encourages grounding in the present and mental courage to face challenges.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-079.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-081.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nStanding Forward FoldUttanasana[ oo-TA-NA-suh-nuh]EXHALE\nBPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-080.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-082.md)\n\n# 3. 3 1\n\n3. 3 1\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bring your hips over your heelsPress the four corners of your feet down Place a slight bend in your kneesPlace a slight bend in your knees to support your back// PELVIS + SPINE Hinge from your hips Draw your tailbone upEngage your abdominals Lengthen your spinePull your navel towards your spine todeepen your fold// ARMS + HEAD Bring your hands to the matDraw your shoulders away from your ears Relax your neck and gaze back\nOPTIONS Bring your feet hips width distanceBend your kneesBring your fingers to the matLOOK FOR Rounded upper back Hips behind heelsBENEFITS Lengthens and relaxes the muscles on the backline of your body. Relaxes your mind and nervoussystem.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-081.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-083.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nHalfway LiftArdha Uttanasana[ arrd-huh-TA-NA-suh-nuh]INHALE\nBPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-082.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-084.md)\n\n# 3. 3 3\n\n3. 3 3\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Shift your weight forwardPlace a slight bend in your knees Bring your hips over your heels// PELVIS + SPINE Lift your chest away from your thighsEngage your shoulder blades togetherExtend your tailbone back// ARMS + HEAD Place your fingers to your shinsDraw your shoulders blades together down your back LengthenthebackofyourneckandgazedownExtend the crown of your head forward to lengthen your spine\nOPTIONS Bend your kneesPlace your hands on your thighsLOOK FOR Rounded backArched back and neckBENEFITS Improves posture by strengthening backline muscles and improves breath by lengthening the frontlineCultivates energy and opening to balance your mind and heart in daily life.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-083.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-085.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nHigh Plank Dandasana[ dun-DA-suh-nuh]EXHALE\nBPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-084.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-086.md)\n\n# 3. 3 5\n\n3. 3 5\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Step your feet back to hips width distance Press through your heelsEngage your legsPress your heels back to activate your legs// PELVIS + SPINE Bring your hips in line with your heels and shoulders Send your tailbone toward your heelsEngage your abdominals// ARMS + HEAD Plant your hands shoulder widthStack your shoulders over your wristsBring your shoulder blades together down your back Lengthen the back of your neck and gaze downPress through your whole palm to fire up your chest\nOPTIONS Bring your knees to the floorLOOK FOR Hips too high Belly to matGaze too far up Compressed neckBENEFITS Teaches your body to behave as a whole. Your large trunk and leg muscles generate power while small extremitymuscles refine that power. Encourages grounding in the present and mental courage to face challenges.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-085.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-087.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nLow PlankChaturanga Dandasana[ chutt-toor-rung-guh-dun-DA-suh-nuh ]EXHALE\nBPCDEMO What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-086.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-088.md)\n\n# 3. 3 7\n\n3. 3 7\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Shift your weight forward Press your heels backEngage your legs// PELVIS + SPINE Engage your abdominalsKeep your hips in line with your heels and shoulders Send your tailbone toward your heels// ARMS + HEAD Stack your elbows over your wrists Bend your elbows up to 90 degreesKeep your shoulders slightly higher than your elbows Lengthen the back of your neck and gaze downSqueeze your elbows into your midline to strengthen your armsBENEFITS Builds upper body strength. Teaches your body to behave as a whole. Your large trunk and leg muscles generatepower while small extremity muscles refine that power.Encourages grounding in the present and mental courage to face challenges.\nOPTIONS Bring your knees to the floor Stay in High PlankLOOK FOR Rounded upper back Belly to mat\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-087.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-089.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nUpward Facing DogUrdhva Mukha Svanasana[ oord-vuh-mook-huh-swuh-NA-suh-nuh ]INHALE\nBPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-088.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-090.md)\n\n# 3. 3 9\n\n3. 3 9\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bring the tops of your feet to the mat Press all your toes into the matLift your knees and thighs up// PELVIS + SPINE Open and pull your chest forward Lift your hipsEngage your abdominalsLift your front hip points up to activate your core// ARMS + HEAD Straighten your armsStack your shoulders over your wristsPress your thumbs and forefingers into the mat Send your gaze forwardSend your gaze forward to lengthen the back of your neck\nOPTIONS Stay in High PlankLOOK FOR Shoulders up Gaze too far upThighs to the matLower body not engagedBENEFITS Improves posture by strengthening backline muscles and improves breath by lengthening the frontline. Cultivates energy and opening to balance your mind and heart indaily life.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-089.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-091.md)\n\n# Page 91\n\n3.4 0© Yoga Flow YOGA Continue flow, build internal heatIntroduce big full body movementsSync movement to breath creating an ebb and flow Strengthen your legsOpen your hipsStart lateral spine flexion\nINTELLIGENT INTENSITY Consider how this series creates intensity by adding split-leg postures and maintaining a similar leg position for longer duration.Notice as you take class that this part looks different in other class formats. Write down variations of the Sun B series that resonate with you.\n\n---\n[← Prev](/pages/page-090.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-092.md)\n\n# 3.4 1Sun Salutation B\n\n3.4 1Sun Salutation B\nINHALE Chair Pose UtkatasanaEXHALE Standing Forward Fold UttanasanaINHALE Halfway Lift Ardha UttanasanaEXHALE High to Low Plank Chaturanga Dandasana INHALE Upward Facing Dog Urdhva Mukha Svanasana EXHALE Downward Facing Dog Adho Mukha Svanasana INHALE Warrior Two Virabhadrasana IIEXHALE Extended Side Angle Utthita Parsvakonasana INHALE Reverse Warrior Parivrtta Virabhadrasana II EXHALE High to Low Plank Chaturanga Dandasana\n\n---\n[← Prev](/pages/page-091.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-093.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nChair PoseUtkatasana[ oot-kuh-TA-suh-nuh ]INHALE\nBPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-092.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-094.md)\n\n# 3.4 3\n\n3.4 3\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bend your kneesShift your weight into your heels Squeeze your inner thighsShift your weight into your heels to activate your glutes// PELVIS + SPINE Lift your chest upDraw your tailbone back and down Engage your abdominals// ARMS + HEAD Reach your arms up, rotate your palms in and shoulder blades forwardDraw the inner border of your shoulder blades down Keep your gaze forward\nOPTIONS Straighten your kneesBring your arms parallel to the floorHands at heart centerLOOK FOR Weight forward Rounded backSway in low backBENEFITS Builds core, leg and glute strength. Encourages grounding in the present and mental courage to face challenges.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-093.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-095.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nWarrior TwoVirabhadrasana[ VEE-ruh-buh-huh-DRA-suh-nuh ]INHALE Sun B Series / EXHALE Triangle Series\n// TRANSITION“Inhale lift your R/L leg high,Exhale Low Lunge...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-094.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-096.md)\n\n# 3.4 5\n\n3.4 5\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Spin your back heel downStack your front knee over your ankleAngle your back foot slightly forward and your front foot forwardPoint your knee in the same direction as your toesPress your feet into the mat and hug your inner leg-line toward center to activate your lower half// PELVIS + SPINE Lift your chest and square to the side Draw your tailbone downStack shoulders over hips// ARMS + HEAD Reach your arms in opposite directionsDraw your shoulder blades together down your back Bring your gaze forward\nOPTIONS Shorten your stanceLOOK FOR Shoulders upKnee behind or in front of ankle Sinking hipsBENEFITS Teaches your body to behave as a whole. Your large trunk and leg muscles generate power while small extremity muscles refine that power. Encourages grounding in the present and mental courage to face challenges.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-095.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-097.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nExtended Side Angle PoseUtthita Parsvokanasana[ oot-teeh-tuh-parrsh-vuh-ko-NA-suh-nuh]EXHALE\nBPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-096.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-098.md)\n\n# 3.4 7\n\n3.4 7\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Keep your front knee over your ankle Maintain the placement of your feetPress the outside edge of your back foot down// PELVIS + SPINE Lift your ribs away from your thighDraw your tailbone toward your back heel Engage your abdominalsLift your ribs away from your thigh to lengthen and strengthen your core// ARMS + HEAD Bring your front elbow to your thigh Reach your back arm upDraw your gaze up or down\nOPTIONS Bring your gaze downPlace your to your thigh Shorten your stanceLOOK FOR Rounded spineKnee in front of or behind ankle Torso resting on thighBENEFITS Teaches your body to behave as a whole. Your large trunk and leg muscles generate power while small extremity muscles refine that power. Encourages grounding in the present and mental courage to face challenges.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-097.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-099.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nReverse Warrior PoseParivrtta Virabhadrasana[ parr-vree-tah VEE-ruh-buh-huh-DRA-suh-nuh ]INHALE\nBPC// TRANSITION To exit pose”Inhale, Exhale High to LowPlank...”What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-098.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-100.md)\n\n# 3.4 9\n\n3.4 9\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Keep your front knee over your front ankle Maintain the placement of your feetPress the outside edge of your back foot down Engage your back legTrack your front knee in line with your middle toes to activate your outer glute// PELVIS + SPINE Lift and keep your chest open to the side Draw your tailbone downBend your torso to the side// ARMS + HEAD Reach your front arm upPlace your back hand lightly on your leg Draw your gaze upLift your front arm up to keep length in your side oblique muscles\nOPTIONS Shorten your stance Bring your gaze downLOOK FOR ShallowKnee in front of ankle Clear backbendBENEFITS Teaches your body to behave as a whole. Your large trunk and leg muscles generate power while small extremity muscles refine that power. Encourages grounding in the present and mental courage to face challenges.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-099.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-101.md)\n\n# Page 101\n\n3. 5 0© Yoga Flow YOGA Rest your arms and legs, belly upActivate your core to prepare for deep twists and balancing Prepare for all inversionsConnect with your students face to face\nTHE CORE The 360-Core refers to the front, back, sides and deep layers of the torso. Some of the muscles included are the three layers of the abdominal muscles: the rectus abs, the obliques, the transverse abs, and the “good postures” muscles in the back: the erector spinae.This series is a reminder that the core gives great stability to the spine in daily life and in yoga postures.\n\n---\n[← Prev](/pages/page-100.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-102.md)\n\n# Page 102\n\n3. 5 1Reclined Bound Angle Pose Sit Ups Supta Baddha Konasana Sit UpsBicycle Sit UpsBoat Pose NavasanaCore Series\n\n---\n[← Prev](/pages/page-101.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-103.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nReclined Bound Angle Sit UpsSupta Baddha Konasana Sit Ups[ soop-tuhbud-huh-ko-NA-suh-nuh]ACTION BREATH\n// TRANSITION“Inhale look forward,Exhale walk through to aseat and lie on your back...”// ACTION“Inhalelengthen your spine, Exhalelift your chest, Inhale lower,Exhale lift...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-102.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-104.md)\n\n# 3. 5 3\n\n3. 5 3\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bend your knees and bring your feet toward your hips Bring the soles of your feet togetherOpen your knees widePress the bottoms of your feet together to activate your pelvic floor// PELVIS + SPINE Lengthen and stabilize yourspine Pull your front ribs inDrawyourshoulderbladestogetheranddownyourbackPull your front ribs down and in to activate your core// ARMS + HEAD Bring your hands behind your head Spread your fingers wideOpen your elbows Keep your gaze up\nOPTIONS Bring your feet to the floor Relax your head on the floorLOOK FOR Elbows inArched low backBENEFITS Strengthens core muscles. Lengthens adductors/inner thighs. Creates focus in the face of challenge.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-103.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-105.md)\n\n# Bicycle Sit UpsACTION BREATH\n\nBicycle Sit UpsACTION BREATH\n// ACTION“Inhalelengthen your spine, Exhale twist right,Inhale return to center, Exhaletwist left...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-104.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-106.md)\n\n# 3. 5 5\n\n3. 5 5\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Stack your right knee over your hip Extend your left leg forwardBend your right knee to a 90 degree anglePress your heels back to activate your legs// PELVIS + SPINE Twist to your rightLengthen and stabilize your spineEngage your abdominals and lift your chest// ARMS + HEAD Bring your L/R elbow to the outside of your opposite thigh Bring your hands behind your headKeep your gaze in the direction of your twist\nOPTIONS Keep your knees bent, feet on floor and twist your L/R elbow to the outside of your opposite thighLOOK FOR Legs upShoulders on matHips rolling from side to sideBENEFITS Supports healthy spine mobility and hydration (discs compress with twist and elongate with return to neutral allowing water/ nutrients in). Challenges your breath and creates a change in perspective or point of view.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-105.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-107.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nBoat PoseNavasana[ nuh-VA-suh-nuh ]EXHALE\n// TRANSITION“Draw yourknees into your chest, Roll up to a seat...”To exit pose, “Cross your ankles, Place your handson the floor, Inhale step back to High Plank...”BPCDEMO What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-106.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-108.md)\n\n# 3. 5 7\n\n3. 5 7\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bend your knees and keep shins parallel to the floor or extend your legs longFlex your toes back toward your face Squeeze your inner thighs// PELVIS + SPINE Lift your chest and lean backBalance your weight on your sits bones Spread your collar bonesto focus on spine length// ARMS + HEAD Reach your arms forward and rotate palms upDraw your shoulder blades together down your back Draw your gaze forward or upLift your gaze to lift your chest\nOPTIONS Bend your knees and bring toes to the floorBring your hands to the floor or back of your thighsLOOK FOR Rounded upper back Hands pull on thighs Lazy feetArched back Gaze too highBENEFITS Trains your stabilizing muscles (inner/outer hips, paraspinals) to help you stay upright, move efficiently and effectively, on and off the mat. Facilitates focus on the present and breath control inorder to create balance and stability.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-107.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-109.md)\n\n# Page 109\n\n3. 5 8© Yoga Flow YOGA Introduce balancingReady for deep twisting now that your body is warm and active Ready to open hip flexors and work on arm balances\nINTELLIGENT SEQUENCING This series builds off of the earlier postures in the C1 sequence and progresses the postures and muscle actions. Sequencing in this way sets up the student for success by placing postures togtherbased on their similarities and level of challenge.\n\n---\n[← Prev](/pages/page-108.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-110.md)\n\n# 3. 5 9Crescent Lunge Series\n\n3. 5 9Crescent Lunge Series\nINHALE Crescent Lunge AnjaneyasanaEXHALE Revolved Crescent Lunge Parivrtta AnjaneyasanaEXHALE Runner’s LungeINHALE Side Plank VasisthasanaEXHALE Prayer Twist Parivrtta Utkatasana EXHALE Gorilla Pose Padahastasana EXHALE Crow Pose Bakasana\n\n---\n[← Prev](/pages/page-109.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-111.md)\n\n# Crescent Lunge PoseAnjaneyasana[ AHN-juh-nay-YA-suh-nuh ]INHALE\n\nCrescent Lunge PoseAnjaneyasana[ AHN-juh-nay-YA-suh-nuh ]INHALE\n// TRANSITION“Inhale lift your R/L leg high,Exhale Low Lunge...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-110.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-112.md)\n\n# 3. 6 1\n\n3. 6 1\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Stack your front knee over your ankle Keep your feet hips width distanceLift and press through your back heelSoften your back knee to level your hips// PELVIS + SPINE Draw your tailbone down and lift your chest up Square and level your hips forwardDraw your front ribs in and lengthen your spineCarve your tailbone down and lift your chest to find axial extension// ARMS + HEAD Reach your arms up, rotate your palms in and shoulder blades forwardKeep your gaze forward\nOPTIONS Bring your back knee to the floorBring your hands to heart centerLOOK FOR Shoulders up Knee not bentSway in low backBENEFITS Builds core and leg strength while opening the hip flexors.Encourages grounding in the present and mental courage to face challenges.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-111.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-113.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nRevolved Crescent Lunge PoseParivrtta Anjaneyasana[ parr-vree-tuhAHN-juh-ney-YA-suh-nuh]EXHALE\n// TRANSITION“Inhale, Exhale bring yourhands to heart center, Inhalelengthen your spine forward...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-112.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-114.md)\n\n# 3. 6 3\n\n3. 6 3\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Keep your front knee stacked over your ankle Maintain the placement of your feetContinue to lift and press through your back heel// PELVIS + SPINE Lift your torso away from your thigh Lengthen your spineDraw your tailbone back// ARMS + HEAD Bring your L/R elbow to the outside of your opposite thigh Press your hands togetherStack your elbows and wrists Turn your gaze upPress your palms together to lift your torso away from your thigh\nOPTIONS Bring your back knee to the floorLOOK FOR Too shallow Shoulders upKnee inside ankle One hip droppedKnee in front of ankleBENEFITS Supports healthy spine mobility and hydration (discs compress with twist and elongate with return to neutral allowing water/ nutrients in). Challenges your breath and creates a change in perspective or point of view.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-113.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-115.md)\n\n# Runner’s LungeEXHALE\n\nRunner’s LungeEXHALE\nBPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-114.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-116.md)\n\n# 3. 6 5\n\n3. 6 5\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Move your front foot up and outStack your front knee over your ankle Press through your back heelHug your legs towards each other to stabilize your pelvis// PELVIS + SPINE Lower your hips downEngage your abdominals Lengthen your spine// ARMS + HEAD Bring your hands to the inside of your front foot Press into your hands or forearmsLengthen the back of your neck\nOPTIONS Bring your back knee to the floorKeep your hips levelLOOK FOR Hips too highRounded upper backHips and thigh to floorBENEFITS Opens the hip flexors and encourages mobility on the frontline of your body. Relaxes your mind and nervous system.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-115.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-117.md)\n\n# FEET + LEGSARMS + HEADMUSCLESJOINTACTIONS\n\nSide Plank PoseVasisthasana[ vuh-siish-TA-suh-nuh ]INHALE\n// TRANSITION“Inhale up to your palms, Exhale High Plank...”To exit pose,“Inhale, Exhale High to LowPlank...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-116.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-118.md)\n\n# 3. 6 7\n\n3. 6 7\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Roll your heels to the left and stack your feet Press the edge of your bottom foot downSqueeze your inner thighs// PELVIS + SPINE Bring your hips in line with your heels and shoulders Draw your tailbone toward your heelsLift your hips upBring your hips in line with your heels and shoulders to brace your core// ARMS + HEAD Reach your right arm up and stack shoulders over wrist Spread your fingers widePress your thumb and forefinger into the mat Extend through your arms and gaze up\nOPTIONS Bring your bottom knee to the floorPlace your top foot on the floor Bring your gaze downLOOK FOR Hips dropFeet not stacked Rainbow side bodyHyperextended elbowBENEFITS Builds upper body strength. Your large trunk and leg musclesgenerate power while small extremity muscles refine that power. Encourages grounding in the present and mental courage to face challenges.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-117.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-119.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nPrayer Twist PoseParivrtta Utkatasana[ parr-vree-tuh oot-kuh-TA-suh-nuh ]EXHALE\n// TRANSITION“Inhale Chair Pose, Exhale bring yourhands to heart center, Inhalelengthen your spine forward...”To exit pose“Inhale, Exhale ForwardFold...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-118.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-120.md)\n\n# PERSONALIZE YOUR PRACTICE Depth \\| Angle \\| Prop \\| Pose\n\n3. 6 9CUES Verb » Your » Body Part » Direction// FEET + LEGS Bend your knees more and squeeze your inner thighs Square your knees forwardBring your left knee in line with your right// PELVIS + SPINE Lift your ribs off your thighsSquare and level your hips forward Draw your tailbone backDraw your chest towards your thumbs to open your chest// ARMS + HEAD Bring your left elbow to the outside of your right thigh Bring your hands to heart centerStack your elbows and wrists and turn your gaze up\nOPTIONS Keep your chest liftedGently twist open to the side reaching one arm forward and one backLOOK FOR Rounded backOne knee forwardHips above shoulders Arched backDeep squatBENEFITS Supports healthy spine mobility and hydration (discs compress with twist and elongate with return to neutral allowing water/ nutrients in). Challenges your breath and creates a change in perspective or point of view.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-119.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-121.md)\n\n# Gorilla PosePadahastasana[ PA-duh-hus-TA-suh-nuh ]EXHALE\n\nGorilla PosePadahastasana[ PA-duh-hus-TA-suh-nuh ]EXHALE\n// TRANSITION“Toe-heel your feet to hipswidth distance, Inhale...”To exit pose,“Release your hands fromunder yourfeet, Toe-heel your feet back to touch...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-120.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-122.md)\n\n# 3 .71\n\n3 .71\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Step your feet hips width distance Bend your kneesBegin to straighten your legs// PELVIS + SPINE Bring your hips up and over your heels Engage your abdominalsLengthen your spineShift your weight towards your toes to line up your heels over your heels and increase your hamstring stretch// ARMS + HEAD Slide your hands palms face up under your feet Bring your toes to your wristsBend your elbows outRelax your neck and gaze back\nOPTIONS Bend your knees moreLOOK FOR Fingers only touching toes Hips behind heelsGaze forwardBENEFITS Lengthens and relaxes the muscles on the backline of your body. Relaxes your mind and nervous system.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-121.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-123.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nCrow PoseBakasana[ buh-KA-suh-nuh ]EXHALE\n// TRANSITION“Inhale plant your hands under yourshoulders...”BPCDEMO What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-122.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-124.md)\n\n# 3 .73\n\n3 .73\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bring your knees to your upper armsShift your weight forward and take one or both feet off the matBring your big toes to touch and squeeze your inner thighs// PELVIS + SPINE Engage your abdominals Lift your hipsPull your front ribs in and up// ARMS + HEAD Place your hands shoulder width distance apart Spread your fingers widePress your thumbs and forefingers into the mat Bring your gaze forward and outPress the base of your fingers down to activate your arms and chest\nOPTIONS Lift your right or left foot onlyLOOK FOR Toes downWeight shifted back Shoulders dip down Knees too wideBENEFITS Strengthens and stabilizes the muscles and joints of your armsand shoulders. Encourages self awareness, discovery, acceptance of our limitations and freedom from self judgment.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-123.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-125.md)\n\n# Page 125\n\n3 . 74© Yoga Flow YOGA Reestablish your focus and drishti after arm balanceUtilize core activationIntroduce pose and counter pose: contract, expand, neutralize Unite your mind and body\n\n---\n[← Prev](/pages/page-124.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-126.md)\n\n# Page 126\n\n3 .75 EXHALE Eagle Pose Garudasana EXHALE Dancer’s Pose Natarajasana INHALE Tree Pose VrksasanaBalancing Series\n\n---\n[← Prev](/pages/page-125.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-127.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nEagle PoseGarudasana[ guh-roo-DA-suh-nuh ]EXHALE\nBPC// TRANSITION“Inhale Chair Pose...”What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-126.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-128.md)\n\n# 3 .77\n\n3 .77\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Cross your R/L leg over your other legBring your toes behind your standing calf Squeeze your inner thighsAlign your knees towards center to stabilize your foundation// PELVIS + SPINE Lift your chest upDraw your tailbone down Lengthen your spine// ARMS + HEAD Cross your R/L arm under your other armWrap your elbows and wrists then bring palms to touch Lift your elbows to shoulder heightBring your gaze forward through your arms\nOPTIONS Place your lifted toes on the groundBring your hands to opposite shouldersDraw your hands to heart centerLOOK FOR Rounded back Hands apart Hips to heelsBENEFITS Trains your stabilizing muscles (inner/outer hips, paraspinals) to help you stay upright, move efficiently and effectively, on and off the mat. Facilitates focus on the present and breath control inorder to create balance and stability.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-127.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-129.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nDancer’s PoseNatarajasana[ nuh-tuh-RA-JA-suh-nuh ]EXHALE\nBPC// TRANSITION“InhaleMountain Pose...”To move to other side,“Inhale, Exhale release, Inhale MountainPose...”What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-128.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-130.md)\n\n# 3 .79\n\n3 .79\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bend your R/L kneeCapture the inside of your R/L foot or ankle Engage your standing legKick your leg up and back// PELVIS + SPINE Lift your chest upLevel and square your hips Tilt your pelvis forwardDraw your front ribs down and in to lengthen your spine// ARMS + HEAD Reach your arms up, rotate your palms in and shoulder blades forwardDraw the inner border of your shoulder blades down Keep your gaze forward\nOPTIONS Keep your knees together Stay uprightKeep your chest liftedLOOK FOR Incorrect grip No kick backStanding leg bentDump into lower backHyperextended standing kneeBENEFITS Trains your stabilizing muscles (inner/outer hips, paraspinals) to help you stay upright, move efficiently and effectively, on and off the mat. Facilitates focus on the present and breath control inorder to create balance and stability.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-129.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-131.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nTree PoseVrksasana[ vrik-SHA-suh-nuh ]INHALE\nBPC// TRANSITION“InhaleMountainPose, Exhale Samasthiti...”To exit,“Inhale, Exhale Samasthiti”What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-130.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-132.md)\n\n# 3. 8 1\n\n3. 8 1\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Place the sole of your R/L foot onto your opposite thigh Press the four corners of your standing foot downPress your foot and thigh against one anotherPress your foot and thigh against each other to strengthen your grounded leg// PELVIS + SPINE Square and level your hips forward Draw your tailbone downLengthen your spine// ARMS + HEAD Bring your hands to heart centerDraw your shoulder blades together down your backReach through the crown of your head and gaze forward\nOPTIONS Place your lifted toes on the floorLOOK FOR Knee pitchedFoot to inside of knee Hips not levelBENEFITS Trains your stabilizing muscles (inner/outer hips, paraspinals) to help you stay upright, move efficiently and effectively, on and off the mat. Facilitates focus on the present and breath control inorder to create balance and stability.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-131.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-133.md)\n\n# Page 133\n\n3. 8 2© Yoga Flow YOGA Save the most complex standing poses until your body is most warm and activeBegin to cool down\n\n---\n[← Prev](/pages/page-132.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-134.md)\n\n# Page 134\n\n3. 8 3INHALE Warrior One Virabhadrasana I EXHALE Warrior Two Virabhadrasana II EXHALE Triangle Pose TrikonasanaEXHALE Wide Leg Forward Fold Prasarita PadottanasanaTriangle Series\n\n---\n[← Prev](/pages/page-133.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-135.md)\n\n# Warrior One PoseVirabhadrasana I[ VEE-ruh-buh-DRA-suh-nuh ]INHALE\n\nWarrior One PoseVirabhadrasana I[ VEE-ruh-buh-DRA-suh-nuh ]INHALE\n// TRANSITION“Inhale lift your R/L leg high, Exhale Low Lunge...”To exit pose,“Inhale, Exhale Warrior Two...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-134.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-136.md)\n\n# PERSONALIZE YOUR PRACTICE Depth \\| Angle \\| Prop \\| Pose\n\n3. 8 5CUES Verb » Your » Body Part » Direction// FEET + LEGS Spin your back heel downStack your front knee over your anklePress the outer edge of your back foot down Lift your inner arch up// PELVIS + SPINE Engage your abdominals and lift your chest up Square and level your hips forwardDraw your tailbone downLift your front hip points up to lengthen your back// ARMS + HEAD Reach your arms up, rotate your palms in and shoulder blades forwardBroaden across your upper backKeep your gaze forward\nOPTIONS Shorten your stanceBring your feet hip width distanceDecrease the bend in your front kneeLOOK FOR Short stanceBack knee bentSway in low backBENEFITS Lengthens and strengthens your psoas muscle. Your large trunk and leg muscles generate power while small extremity muscles refine that power. Encourages grounding in the present andmental courage to face challenges.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-135.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-137.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nTriangle PoseTrikonasana[ tree-ko-NA-suh-nuh ]EXHALE\n// TRANSITION“Inhalestraighten your right leg...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-136.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-138.md)\n\n# 3. 8 7\n\n3. 8 7\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Straighten your front legEngage your inner and outer thighs Draw your legs toward one another// PELVIS + SPINE Shift your hips back and reach your torso forward Draw your tailbone backLengthen your spineEngage your abdominals Rotate your torso up// ARMS + HEAD Bring your front hand down and your back hand upDraw your shoulder blades together and down your back Extend through your arms and gaze upReach your top arm up to lift your torso away from your thigh and engage your oliques\nOPTIONS Shorten your stancePlace your hand on your shin or thighPlace a block beneath your bottom handBring your gaze downLOOK FOR Overarched side bodyArched low back Front ribs outLocked front kneeBENEFITS Teaches your body to behave as a whole. Your large trunk and leg muscles generate power while small extremity muscles refine that power. Encourages grounding in the present and mental courage to face challenges.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-137.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-139.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nWide Leg Forward FoldPrasarita Padottanasana[ pruh-SAH-rih-tuhPA-doh-TTA-NA-suh-nuh]EXHALE\n// TRANSITION“Inhale rise, Exhale pivot your feetparallel to the short edges of your mat,Inhale reach your chesthigh...”To exit pose,“Inhale rise up, Exhale Warrior Two, Inhale,Exhale High to Low Plank...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-138.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-140.md)\n\n# 3. 8 9\n\n3. 8 9\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bring your feet parallel or pigeon-toedPress the outside edges of your feet down Lift your inner arches upEngage your legsShift your weight forward to deepen your fold// PELVIS + SPINE Hinge from your hips Draw your tailbone upShift your weight forward Lengthen your spine// ARMS + HEA Don second side, option for chest expansionBring your hands to the mat or outside your heels Draw your shoulders away from your earsRelax your neck and gaze back\nOPTIONS Bend your kneesShorten your stanceBring your hands to the floor or your calvesLOOK FOR Rounded upper backForehead to mat Hips behind heelsBENEFITS Lengthens and relaxes the muscles on the backline of your body. Relaxes your mind and nervous system.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-139.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-141.md)\n\n# Page 141\n\n3. 9 0© Yoga Flow YOGA Stretch your hip muscle while they are warm from the standing seriesOpen your hips before backbends\nTHE HIPS What we call the hips includes multiple muscle groups that support your foundation, ability to stand upright, move, walk, run and do yoga asana (poses). Though the hips series only includes one posture, it is impactful. Muscles that vary in size and function such as the glutes, adductors, abductors, hip flexors, and piriformis to name a few, are affected when we do hip opening postures like half pigeon.\n\n---\n[← Prev](/pages/page-140.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-142.md)\n\n# 3. 9 1EXHALE Half Pigeon Eka Pada RajakapotasanaHip Series\n\n3. 9 1EXHALE Half Pigeon Eka Pada RajakapotasanaHip Series\n\n---\n[← Prev](/pages/page-141.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-143.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nHalf Pigeon PoseEka Pada Rajakapotasana[ eh-kuh-PA-duh-RA-JA-kuh-po-TA-suh-nuh]EXHALE\n// TRANSITION“Inhale lift your R/L leg high...”To exit pose,“Inhale, Exhale DownwardFacing Dog.”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-142.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-144.md)\n\n# 3. 9 3\n\n3. 9 3\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bring your right knee to outside of your right wrist Work your shin forwardFlex your right footExtend your left leg straight backRotate your back leg down to level your hips// PELVIS + SPIN Espine vertical 3 breaths, fold forward 3 breathsFold your torso forward over your thigh Square your hips forwardLengthen your spine// ARMS + HEAD Rest your forehead on the mat Press your hands into your matDraw your shoulder blades down your back\nOPTIONS Bring your front foot closer to your hipBring your elbows to the floorPlace a block beneath your front hipMove to Supine Figure 4LOOK FOR Roll weight to one leg Sickled footRoll all the way to the floorBENEFITS Lengthens the hip flexors. When your torso is vertical, strengthens the backline of your body. When your torso is forward, relaxes your mind and nervous system.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-143.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-145.md)\n\n# Page 145\n\n3. 9 4© Yoga Flow YOGA Backbend when your body is most warm and readyFocused on poses that move against gravity - these are safe for beginners Requires established core strength and open hipsStrengthens your back body Opens your front bodyAvoid alternating deep forward folds with deep backbends\nTHE SPINE The spine series moves the spine into extension. In normal daily life, the spine is often in flexion and rarely in extension. Notice the energetic effect on your bodynot just in the physical aspect, but also in the energetic. Moving the spine in all directions is the key to spinal health.\n\n---\n[← Prev](/pages/page-144.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-146.md)\n\n# 3. 9 5Spine Series\n\n3. 9 5Spine Series\nINHALE Cobra Pose Bhujangasana INHALE Bow Pose Dhanurasana EXHALE Camel Pose UstrasanaINHALE Bridge Pose Setu Bandha SarvangasanaEXHALE Reclined Bound Angle Pose Supta Baddha Konasana\n\n---\n[← Prev](/pages/page-145.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-147.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nCobra PoseBhujangasana[ buhooj-jung-GA-suh-nuh ]INHALE\n// TRANSITION“Inhale High Plank, Exhale slowly lower down tothe mat,Place yourhands lightly under yourshoulders...”To exit pose,“Inhale, Exhale lower down,Bring yourleft ear to the mat...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-146.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-148.md)\n\n# 3. 9 7\n\n3. 9 7\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bring the tops of your feet downPress all your toenails into the mat Squeeze your inner thighsEngage your legs// PELVIS + SPINE Draw your tailbone back and lift your chest forward then up Engage your abdominalsSpread your collar bonesLengthen your tailbone towards your heels to lengthen your back// ARMS + HEAD Place your hands lightly under your shouldersDraw your shoulder blades together down your back Lengthen the back of your neck and gaze out\nOPTIONS Keep your chest closer to the floorLOOK FOR Tucked toesShoulder heads downGaze too far up and back Sickled anklesLow back compressedBENEFITS Improves posture by strengthening backline muscles and improves breath by lengthening the frontline. Cultivates energy and opening to balance your mind and heart in daily life.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-147.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-149.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nBow PoseDhanurasana[ duh-hun-noor-RA-suh-nuh ]INHALE\n// TRANSITION“Bring your chin back tocenter, Reach back andcapture theoutside edges of your feet...”To exit pose,“Inhale, Exhale lower down,Bring yourright ear to the mat.”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-148.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-150.md)\n\n# 3. 9 9\n\n3. 9 9\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bend your knees and pull them togetherReach back and capture the outside of your feet Kick into your hands and lift your thighs up// PELVIS + SPINE Draw your tailbone back and lift your chest forward then up Engage your abdominalsRoll to the soft part of your abdomen// ARMS + HEAD Extend your arms straight backDraw your shoulder blades together down your back Lengthen the back of your neck and gaze outHug your shoulder blades together and down to open through your chest\nOPTIONS Keep your thighs on the floor Draw your chin downUse a strap around your feet Move to Cobra PoseLOOK FOR Knees bow outNeck compressedCrunched in lower backBENEFITS Improves posture by strengthening backline muscles and improves breath by lengthening the frontline. Cultivates energy and opening to balance your mind and heart in daily life.\n\n---\n[← Prev](/pages/page-149.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-151.md)\n\n# Camel PoseUstrasana[ OOSH-TRA-suh-nuh ]EXHALE\n\nCamel PoseUstrasana[ OOSH-TRA-suh-nuh ]EXHALE\n// TRANSITION“Press up to all fours, Standon your knees,Bring yourpalms to your lower back,Point yourfingers down, Inhale...”To exit pose, “Place yourhands on your lower back,Inhale rise up, Exhale sit on your heels...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-150.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-152.md)\n\n# 3 .101\n\n3 .101\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Bring your knees to hips width distance Engage your legsPress the tops of your feet into the matGuide your thighs forward to align your hips over your knees// PELVIS + SPINE Press your hips forward Stack your hips over knees Draw your tailbone down Lift your chest up// ARMS + HEAD Draw your gaze up then backGrab your heels with your thumbs on the outside ankle\nOPTIONS Keep your hands on your hips Keep your gaze up instead of backTuck your toes and place the balls of your feet on the floorLOOK FOR Neck gazing too far back Shoulders forwardHips in front of kneesBENEFITS Improves posture by strengthening backline muscles and improves breath by lengthening the frontline. Cultivates energy and opening to balance your mind and heart in daily life.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-151.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-153.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nBridge PoseSetu Bandha Sarvangasana[she-too-bun-duh-huh sar-wung-GA-suh-nuh]INHALE\n// TRANSITION“Lie down on your back,Bend yourknees, Plant your feethip width distance...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-152.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-154.md)\n\n# 3 .103\n\n3 .103\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Plant your feet parallel at hips width distancePress down through all four corners of your feet Stack your knees over your anklesPress your heels down to activate your glutes and lift your hips higher// PELVIS + SPINE Lift your hips up Lift your chestDraw your tailbone forward// ARMS + HEAD Draw your shoulders together down your back Push the back of your head down and gaze up Press your arms downOption to interlace your fingers under your hips\nOPTIONS Lift your hips halfwayPlace a block under your sacrumLOOK FOR Knees wide Toes outChin into chestHeels closer than knees, Hips higher than kneesBENEFITS Improves posture by strengthening backline muscles and improves breath by lengthening the frontline. Cultivates energy and opening to balance your mind and heart in daily life.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-153.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-155.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nReclined Bound Angle PoseSupta Baddha Konasana[ soop-tuh-bud-huh-ko-NA-suh-nuh ]EXHALE\nBPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-154.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-156.md)\n\n# 3 .105\n\n3 .105\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Keep your feet close to your hips with your knees bent Bring the soles of your feet togetherRelax your knees to the sides to externally rotate (open) your hips // PELVIS + SPINE Lengthen your spineRelease your abdominalsDraw your shoulder blades together down your back// ARMS + HEAD Rest your arms on the mat with palms face up Release the muscles of your face and neckDraw your gaze up\nOPTIONS Bring your feet to the floor Point your knees upwardBring your feet further away from your hipsLOOK FOR Arched lower backShoulders up toward earsBENEFITS Stretches the adductors/inner thighs and opens the hips.Slight low back flexion promotes a neutralizing effect afterlarger backbends in preparation for lying flat on the ground for Savasana, Allows the body to begin to rest at the end of thepractice.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-155.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-157.md)\n\n# Page 157\n\n3 .106 © Yoga Flow YOGA Neutralize your spineCool your body Rest and restoreTotal body release\nWHY REST?The Surrender series is an important part of most yoga asana classes and it is common for this part to be challenging for new practitioners because of its emphasis on slowing down and stillness. In a 60-minute Yoga Flow Yoga class, this series includes Savasana, which at minimum should be held for two minutes.\n\n---\n[← Prev](/pages/page-156.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-158.md)\n\n# 3 .107 Surrender Series\n\n3 .107 Surrender Series\nEXHALE Seated Forward Fold Paschimottanasana EXHALE Happy Baby Pose Ananda Balasana EXHALE Supine Twist Jathara Parivartanasana EXHALE Corpse Pose SavasanaINHALE Easy Pose Sukhasana\n\n---\n[← Prev](/pages/page-157.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-159.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nSeated Forward Fold PosePaschimottanasana[ puh-sh-chi-mo-TA-NA-suh-nuh ]EXHALE\n// TRANSITION“Draw your knees into your chest, Roll up to a seat, Extendyour legs with a slight bend in your knees, Inhale...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-158.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-160.md)\n\n# 3 .109\n\n3 .109\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Extend your legs with a slight bend in your knees Flex your feetBegin to straighten your legs// PELVIS + SPINE Sit tall and hinge forward at your hips Draw your tailbone backLift your chest and lengthen your spineExtend your chest forward to maintain length in your spine// ARMS + HEAD Reach your hands forward and grab your feet Draw your shoulders down your backLengthen the back of your neck and gaze out\nOPTIONS Bend your kneesPlace your hands anywhere on your legs or the floorLOOK FOR Back rounded Laying on legsReaching past feetBENEFITS Lengthens and relaxes the muscles on the backline of your body. Relaxes your mind and nervous system.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-159.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-161.md)\n\n# Happy Baby PoseAnanda Balasana[ AH-nun-duh BA-LA-suh-nuh ]EXHALE\n\nHappy Baby PoseAnanda Balasana[ AH-nun-duh BA-LA-suh-nuh ]EXHALE\n// TRANSITION“Slowly loweronto your back,Inhale bring your knees to your chest...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-160.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-162.md)\n\n# 3 .111\n\n3 .111\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Open your kneesGrab the inner arches of your feet Gently pull your knees downPress your feet straight up// PELVIS + SPINE Lengthen your spineDraw your tailbone forward Pull your hips down// ARMS + HEAD Bend your elbows outPress your shoulders into the matPush the back of your head down and gaze upGently pull your knees down to open your hips\nOPTIONS Grab your calves or shinsLOOK FOR Tailbone off floorHead and shoulders off floorBENEFITS Lengthens and relaxes the muscles on backline of your body. Relaxes your mind and nervous system.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-161.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-163.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nSupine Twist PoseJathara Parivartanasana[ juh-tuh-ruhparr-ee-varr-tuh-NA-suh-nuh ]EXHALE\nBPC// TRANSITION“Pull your R/L knee to yourchest, Extend your other leg long, Inhale...”What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-162.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-164.md)\n\n# 3 .113\n\n3 .113\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Pull your R/L knee to your chest and extend your other leg longGuide your knee across your body Engage your extended leg// PELVIS + SPINE Stack your hipsEngage your abdominals Lengthen your spineShift your hips to the center of your mat to stack your hips// ARMS + HEAD Reach your R/L arm outKeep both of your shoulders on the mat Turn your gaze away toward the R/L\nOPTIONS Keep knees together Gaze straight upPlace your hand on youropposite thigh for supportLOOK FOR Knee into chest or to the mat Misaligned spineHips not stackedBENEFITS Supports healthy spine mobility and hydration (discs compress with twist and elongate with return to neutral allowing water/ nutrients in). Challenges your breath and creates a change in perspective or point of view.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-163.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-165.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nCorpse PoseSavasana[ shuh-VA-suh-nuh ]EXHALE\nBPC// TRANSITION“Hug yourknees into your chest, Inhale...”What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-164.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-166.md)\n\n# 3 .115\n\n3 .115\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Extend your legs hips width distance Roll your feet outRelax your legs// PELVIS + SPINE Draw your tailbone forward Soften your abdominalsDraw your shoulder blades together down your back// ARMS + HEAD Rest your arms on the mat with palms face up Relax your entire bodyRelease the muscles of your face and neckClose your eyes and return to your natural breath\nOPTIONS Bend your kneesLOOK FOR Everything engaged Feet flexedShoulders toward earsBENEFITS Promote complete relaxation of the physical body andpresence for the mind. Allows for deep restoration before you move on from your practice.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-165.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-167.md)\n\n# FEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\nEasy PoseSukhasana[ sook-HA-suh-nuh ]INHALE\n// TRANSITION“Reach your arms andlegs long,Roll to either side, Draw your knees in toward yourchest, Press up to a seat...”BPC What setup cues will mov e your students into the pose? In what order? What deepening cues will help their pose? Where do you feel this pose? How does it benefit you?\nFEET + LEGSPELVIS + SPINEARMS + HEADMUSCLESJOINTACTIONS\n\n---\n[← Prev](/pages/page-166.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-168.md)\n\n# 3 .117\n\n3 .117\nCUES Verb » Your » Body Part » Direction// FEET + LEGS Cross your legsAllow your knees openDraw your outer hips down// PELVIS + SPINE Press firmly through your sits bones Stack your shoulders over your hips Lengthen your spine// ARMS + HEAD Bring your hands to heart centerDraw your shoulder blades down your back Keep your gaze forward*Land your Theme\nOPTIONS Sit on a blockLOOK FOR Rounded or arched back Knees high or wideBENEFITS Promotes axial extension and core strength. Prepares the body for proper alignment in meditation. Prepares the mind for the transition from practice back to life.\nPERSONALIZE YOUR PRACTICE Depth | Angle | Prop | Pose\n\n---\n[← Prev](/pages/page-167.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-169.md)\n\n# Page 169\n\n---\n[← Prev](/pages/page-168.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-170.md)\n\n# Page 170\n\n---\n[← Prev](/pages/page-169.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-171.md)\n\n# C1 Sample Script\n\nC1 Sample Script\n\n---\n[← Prev](/pages/page-170.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-172.md)\n\n# Page 172\n\nIntegration\"Welcome to your C1 Practice, my name is Graceand I am grateful to share this hour with you. Come down to your mat into table topand press back to Child’s Pose. Seal your lips and inhale and exhale through your nose. Pretend you are blowing air through a straw as you create an audible breath. This is called your Ujjayi breath.Child’s Pose is a resting pose you can return to at any time. I’ll also be offering hands-on assists in addition to cuing and demonstrations. Please flip your token to the “No” side if you’d like to opt out.” IN TableTopTransition: Plant your palms to your matEX DownwardFacingDogSetup Cue: 1. Lift your hips up2. Press your chest backDeepening Cue: 1. Bend your knees to create space in your legs and back2. Gaze towards your feet to relax your neck Transition: IN Gaze ForwardEX RagdollSetup Cue: 1. Walk your feet up to your hands, feet hip-width2. Reach for opposite elbows and hang Transition: Release your arms. Bring your feet to touch. Roll up to standing. Intention “Inhale lift your shoulders up,exhale roll your shoulders back and bring your hands to prayer at heart center. Close your eyes or soften your gaze. Welcome into your heart the feeling of GRATITUDE*. When you focus on gratitude, you shift from scarcity to abundance. Inhale, I am, exhale, abundant gratitude.” *Theme verbs: Reciprocate, Invite, UnifyposesAsyoucueeachpose,offer2-3Setupcuestosupporttheoverallshapeofthepose,then1-2DeepeningcueslikeMuscleActionCuesorOptions.Someareleftblankforyou.INTEGRATIONEX Child’sPoseIN TableTopEX DownwardFacingDogIN GazeforwardEX RagdollLoweryourhands,stepyourfeettogetherandrolluptostanding\nINTENTION StandatAttention–Launch1wordthemeReleaseyourhandstoyourside,openyoureyes\n\n---\n[← Prev](/pages/page-171.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-173.md)\n\n# HightoLowPlankDemoReturntoDownwardFacingDog2xflow\n\nSun A IN MountainPoseSetup Cue: 1. Reach your arms up2. Turn your pinkies inward Disengage the BreathDeepening Cue: 1. Pin your inner ankles to center your balance2. Close the gap between your hip pointers and ribs to engage your coreEX ForwardFoldSetup Cue: 1. Bring your hands through heart and fold forward2. Bend your knees any amount for support Deepening Cue: 1. Shift weight forward to stack your hips and ankles2. Tuckyourchinintoyourchesttostretchyourupper backHigh to Low Plank Demo“Come down to your knees. I’ll demonstrate options to help you feel successful and supported during your High to Low Plank transitions. Each posture has its own breath and alignment. Pick the option that supports you today or try all three…From Halfway Lift demo High to Low plank with 1-2 basic cues for:- High Plank, Low Plank, and Upward Facing Dog- High to Low Plank from knees- Verbally offer layer of holding High Plank to personalize- Add your cues to the flow when they fit into your breath rhythmposesSUNAIN MountainPoseEX ForwardFoldIN HalfwayLiftEX HightoLowPlankIN UpwardFacingDogEX DownwardFacingDogIN LookforwardEX ForwardFoldIN HalfwayLiftEX ForwardFold\nHightoLowPlankDemoReturntoDownwardFacingDog2xflow\n\n---\n[← Prev](/pages/page-172.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-174.md)\n\n# Page 174\n\nSun BIN ChairPoseSetup Cue: 1. Bend your knees and sit your hips back2. Reach your arms up Disengage the BreathDeepening Cue: 1. Pin your inner ankles to center your balance2. Close the gap between your hip pointers and ribs to engage your coreIN Warrior2Setup Cue: 1. Rise to stand and parallel your back foot with the back of the mat2. Stack your shoulders over your hips and bring your arms out to a TDisengage the BreathDeepening Cue: 1. Walk your front toes out past your front knee, and deepen your lunge2. Hug your belly towards your spine to engage your core musclesEX ExtendedSideAngleSetup Cue: 1. Hinge from your hips and bring your front elbow to your front thigh2. Reach your back arm towards the ceiling or overheadDeepening Cue: 1. Push into both feet to strengthen your foundation2. Lengthen your tailbone towards your back heel to lengthen through your spineIN ReverseWarriorSetup Cue: 1. Stay low in your lunge2. Reach your front arm up and backDisengage the BreathDeepening Cue: 1. Press into your back foot to press your hips forward and lift out of your back hip joint2. Draw your ribs together to reconnect to your coreposesSUNBIN LookforwardEX ForwardFoldIN HalfwayLiftEX ForwardFoldIN ChairPoseEX ForwardFoldIN HalfwayLiftEX HightoLowPlankIN UpwardFacingDogEX DownwardFacingDogIN ThreeLegDogRightLegEX LowLungeIN Warrior2EX ExtendedSideAngleIN ReverseWarriorEX HightoLowPlankIN UpwardFacingDogEX DownwardFacingDog2xflowLowerdowntoyourkneesforCoreIN ThreeLegDogLeftLegEX LowLungeIN Warrior2EX ExtendedSideAngleIN ReverseWarriorEX HightoLowPlankIN UpwardFacingDogEX DownwardFacingDog\n\n---\n[← Prev](/pages/page-173.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-175.md)\n\n# Page 175\n\nCore“Come down to your knees and take a quick break. Lower down to your back for Core.”Reclined Bound Angle Sit-upsPress the soles of your feet together. Slide your fingers by your ears. Music FormulaMovementLift –Lower –Lift –Lower Exhale –Inhale –Exhale –Inhale CoachingGaze up to keep length in your spine Lift your heels up to challenge yourself or table top your legs to lessen the intensity Countdown Last 8…Hug your knees in 4…Bicycle TwistsPress the soles of your feet together. Slide your fingers by your ears. Music FormulaMovementTwist Right –Center –Twist Left -CenterExhale –Inhale –Exhale –Inhale CoachingLine up your heels over your hips to engage your core Meet your elbow to your knee to maximize your twistCountdown Last 8…Full body stretch in 4…Roll up to Boat Pose Setup Cue:1. Grab behind your knees or extend your arms2. Lift your chest Deepening Cue:1. Extend your legs to challenge your core 2. Draw your gaze up to maintain the lift in your chestposesCOREEX ReclinedBoundAngleSit-upsEX BicycleTwistsIN BoatPoseRockandrolltoHighPlankINEX HightoLowPlankIN UpwardFacingDogEX DownwardFacingDog\n\n---\n[← Prev](/pages/page-174.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-176.md)\n\n# Page 176\n\nCrescent Series (pt. 1)IN CrescentLungeSetup Cue: 1. Lift your arms up2. Steer both hips forward to face the frontDisengage the BreathDeepening Cue: 1. Drag your heels together to ignite your legs2. Line up your shoulders over your hips to maintain axial extensionEX RevolvedCrescentLungeSetup Cue: 1. Bring your hands to heart center and lean forward2. Hook your elbow to the outside of your thighDeepening Cue: 1. Lift your torso away from your spine to lengthen and strengthen your obliques2. Lower down to your knee to focus on the spineIN, EX Runner’s LungeSetup Cue: 1. Release your hands to the mat inside of your front foot2. Move your front foot forward and out to stack your knee over your ankleDeepening Cue: 1. Hug your legs towards each other to stabilize through your pelvis2. Energize through your back heel or soften your knee to the ground*Theme Action Cue: Honor what your body needs in this moment.Transition: Step back to High PlankIN SidePlankSetup Cue: 1. Pivot your heels R/L and shift your weight to your R/L hand2. Reach the other arm up Disengage the BreathDeepening Cue: 1.stack your shoulders over your supporting wrist and soften through your elbow and push into your hand to lift out of your joints2.Bring your hips in line with your heels and shoulders to activate your core*Repeat on other side before moving to Prayer Twist*posesCRESCENTSERIESIN ThreeLegDogRightLegEX LowLungeIN CrescentLungeEX RevolvedCrescentLungeIN CenterEX Runner’sLungeStepbacktoHighPlankIN SidePlankFacingRIN LookforwardEX ForwardFoldIN HalfwayLiftEX ForwardFoldIN ChairEX PrayerTwistRINEX GorillaPoseIN ChairEX PrayerTwistLINEX GorillaPoseCrowPoseDemonstrationEX Child’sPoseIN ThreeLegDogLeftLegEX LowLungeIN CrescentLungeEX RevolvedCrescentLungeIN CenterEX Runner’sLungeStepbacktoHighPlankIN SidePlankFacingL\n\n---\n[← Prev](/pages/page-175.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-177.md)\n\n# Page 177\n\nCrescent Series (pt. 2)IN ChairPoseEX PrayerTwistSetup Cue: 1. Bring your hands to heart center and lean forward2. Hook your elbow to the outside of your thighDeepening Cue: 1. Press your palms into one another to lift your chest2. Hug your inner thighs together to align your hipsIN,EX GorillaPoseSetup Cue: 1. Fold forward and release your hands to the mat2. One at a time, slide your hands under your feet and face your palms upDeepening Cue: 1. Bend your knees generously to release your back line2. Let your head hang heavy to relax your neck and shoulders*Theme Action Cue: Wiggle your toes to massage your palms and wrists, andshow them some love and appreciation.*Repeat Prayer Twist on the Left, then bring your students to a seat*Crow Pose Demo“Plant your palms at least shoulder-width apart. Squat down and lift your heels up. Bring your knees up towards your triceps or elbows. Bend your elbows to create a shelf and shift forward to place more weight on your hands. Play with lifting one or both legs off ofyour mat. Look forward instead of down to avoid rolling forward. Remember to breathe. Rest in Child’s Pose when you’re done. posesCRESCENTSERIESIN LookforwardEX ForwardFoldIN HalfwayLiftEX ForwardFoldIN ChairEX PrayerTwistRINEX GorillaPoseIN ChairEX PrayerTwistLINEX GorillaPoseCrowPoseDemonstrationEX Child’sPose\n\n---\n[← Prev](/pages/page-176.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-178.md)\n\n# Page 178\n\nBalancing Series”IN ChairEX EaglePoseSetup Cue: 1. Hug your right arm under your left and join your elbows, wrists and palms2. Lift your right leg and wrap it over your leftDeepening Cue: 1. Choose a bear hug to free space in your shoulders and chest2. Line up your knees and belly button to align your spineRepeat left sideIN Mountain PoseEX Dancer’sPoseSetup Cue: 1. Lower your right arm to your hip and reach back to capture your right foot2. Stretch your left arm up and lift your gaze Deepening Cue: 1. Draw your inner knees towards center to stabilize your backbend2. Kick into your hand to open your chestRepeat left sideIN TreePoseSetup Cue: 1. Place your right foot into your left ankle, calf or inner thigh avoiding the knee2. Guide your palms to heartDisengage the BreathDeepening Cue: 1. Reciprocate the press of your foot into your leg to firm up your standing leg2. Extend your lifted knee to the side to open your hip Repeat left side*Theme Action Cue: Invite the quality of reciprocity as you balance. Gratitude does not diminish the more you share it. In fact, the more it is shared, the more opportunity for it to regenerate. posesBALANCINGSERIESIN ChairEX EaglePoseRIN ChairEX EaglePoseLIN MountainEX Dancer’sPoseRIN MountainEX Dancer’sPoseLIN MountainPoseEX StandatAttentionIN TreePoseREX StandatAttentionIN TreePoseREX StandatAttentionIN TreePoseRIN MountainPoseEX ForwardFoldIN HalfwayLiftEX HightoLowPlankIN UpwardFacingDogEX DownwardFacingDog\n\n---\n[← Prev](/pages/page-177.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-179.md)\n\n# Page 179\n\nTriangle Series“IN Warrior1Setup Cue: 1. Plant your back heel down2. Rise to stand and bring arms your overheadDisengage the BreathDeepening Cue: 1. Press the pinky edge of your back foot down to activate your back leg2. Lift your front hip points up to lengthen your lower backEX Warrior2IN ExtendyourfrontkneeEX TrianglePoseSetup Cue: 1. Hinge forward and bring your front hand to your front shin or a block2. Reach your back hand upDeepening Cue: 1. Soften through your front knee and draw your legs towards each other to connect to your inner thighs and core2. Lift your torso away from your front thigh to activate your obliquesIN StarPoseEX ParallelyourfeetandbringyourarmstoaTIN LiftyourchestEX WideLegFoldSetup Cue: 1. Hinge forward from your hips2. Bring your hands to the floor or to a block Deepening Cue: 1. Turn your toes in and soften your knees to create space your low back2.Hang your head heavy and relax your neck to decompress your spineposesTRIANGLESERIESIN ThreeLegDogRightLegEX LowLungeIN Warrior1EX Warrior2IN StraightenyourlegEX TriangleIN StarEX Wide-legFoldIN ThreeLegDogLeftLegEX LowLungeIN Warrior1EX Warrior2IN StraightenyourlegEX TriangleIN StarEX Wide-legFold,optionforchestexpansion\n\n---\n[← Prev](/pages/page-178.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-180.md)\n\n# Page 180\n\nHips\"EX HalfPigeonSetup Cue: 1. Bring your (R or L) knee behind your (same-R or L) wrist and rest your shin on the mat2. Slide your back toes out to extend through your back legDeepening Cue: 1. Adjust the angle of your front shin to take pressure out of your knee joint and bring sensation to your front outer hip2. Drive your back hip forward to lengthen your hip flexorRepeat on other sideTransition: Shift to high plank, lower to your belly. Spine“IN CobraPoseSetup Cue: 1. Keep your hands under your shoulders and zip your legs up together2. Lift your chest and lengthen your gaze forwardDisengage the BreathDeepening Cue: 1. Push into the tops of your feet to activate through the backs of your legs2. Hug your belly in and spiral your inner thighs up and back to connect to your core and release your low backTransition: Release, gaze right. Bring your chin back to center.IN BowPoseSetup Cue: 1. Bend your knees and kick your heels towards your glutes2. Reach your arms back towards your feet, and if you can make contact, take your feet into your hands Disengage the BreathDeepening Cue: 1. Kick your feet into your hands to expand through your chest2. Bring your weight onto the soft part of your belly, to take any pressure out of your hip pointsRelease, gaze left. posesHIPSIN ThreeLegDogRightlegEX HalfPigeonINEX DownwardFacingDogIN ThreeLegDogLeftlegEX HalfPigeonINEX DownwardFacingDogSPINEIN HighPlankEX LowertoyourbellyIN CobraPoseEX Lower,gazerightIN BowPoseEX Lower,gazeleftIN Center,pressuptoTableTopEX CamelPoseLowertoyourbackIN BridgePoseEX ReclinedBoundAnglePose\n\n---\n[← Prev](/pages/page-179.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-181.md)\n\n# Page 181\n\nSpine (cont.)“Transition:Pressuptotabletopandstanduponyourknees.EX CamelPoseSetup Cue: 1. Bring your hands to your low back, pointing your finger tips down2. Send your hips forward, as you walk your gaze up and back along the ceilingDeepening Cue: 1. Push into your shins or feet to feel your glutes and hamstrings support you2. Hug your inner thighs together and spiral them back to real ease your low back Transition: Lower down to your back, plant your feet down.IN BridgePoseSetup Cue: 1. Bend your knees and bring your feet in line with your hips near your glutes2. Press into your feet to lift your hipsDisengage the BreathDeepening Cue: 1. Squeeze your inner thighs together to connect to your core2. Draw your chin away from your chest to extend your neck and throatEX ReclinedBoundAngleSetup Cue: 1. Bring the soles of your feet together and allow your knees to open to the sides2. Option to bring one hand to your belly and the other to your heart*Theme Action Cue: Pause here for a few breaths. Take this moment to appreciate how hard you’ve worked thus far. posesSPINEIN HighPlankEX LowertoyourbellyIN CobraPoseEX Lower,gazerightIN BowPoseEX Lower,gazeleftIN Center,pressuptoTableTopEX CamelPoseLowertoyourbackIN BridgePoseEX ReclinedBoundAnglePose\n\n---\n[← Prev](/pages/page-180.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-182.md)\n\n# EasySeat–LandyourTheme\n\nSurrender“Transition:Rolluptoaseat.IN,EX SeatedForwardFoldSetup Cue: 1. Extend your legs out in front of you and reach your arms overhead2. Fold forward and reach towards your legs or feetDeepening Cue: 1. Bend your knees a lot or a little, to release your hamstrings and low back2. Send your tailbone back and the crown of your head forward to extend through your spineIN,EX HappyBabySetup Cue: 1. Reach your hands to your inner arches of your feet or ankles2.Bring your knees outside of your ribs and bend your kneesDeepening Cue: 1. Rock side to side to massage your spine and calm your nervous system2. Option to extend and bend one or both legs at a timeIN,EX SupineTwistSetup Cue: 1. Draw your (R or L) knee to your chest and extend the other one out along the ground2.Send your knee over to the opposite side and gaze over your (R or L) shoulderDeepening Cue: 1. Option to use your hand to gently press your thigh away from you to deepen the stretch in your outer hip*Repeat on other side“Inhale, Hug you knees back to center. Exhale Final Resting Pose Savasana. Release your arms and legs out. Let go of any effort in your muscles and close your eyes. Minimum 2 minutes of silence.Start to reawaken movement. Stretch your arms out and roll to your right side. Press up to Easy Seat, with eyes closed and palms pressed together at your heart. Invite the quality of gratitude into your daily practice. Notice how you shift from scarcity to abundance. From our grateful hearts, we bow forward together in honor of each other. Thank you. posesSURRENDER RiseuptoaseatINEX SeatedForwardFoldLowertoyourbackIN KneestochestEX HappyBabyIN RightkneeinEX SupineTwistIN LeftkneeinEX SupineTwistIN BallPoseEX Savasana\nEasySeat–LandyourTheme\n\n---\n[← Prev](/pages/page-181.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-183.md)\n\n# Page 183\n\n---\n[← Prev](/pages/page-182.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-184.md)\n\n# Page 184\n\n---\n[← Prev](/pages/page-183.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-185.md)\n\n# Page 185\n\n---\n[← Prev](/pages/page-184.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-186.md)\n\n# Page 186\n\n---\n[← Prev](/pages/page-185.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-187.md)\n\n# Page 187\n\n---\n[← Prev](/pages/page-186.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-188.md)\n\n# Page 188\n\n---\n[← Prev](/pages/page-187.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-189.md)\n\n# Page 189\n\n1.Whatistheadjustmentthatyoufeelmostproficientgiving? Least proficient? 2.Describe threeadjustments forTrianglePose. 3.Whichadjustmentdoyouenjoygivingthemost?Whichadjustmentdoyouneedtopracticemoretounderstand?\n\n---\n[← Prev](/pages/page-188.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-190.md)\n\n# Page 190\n\nAssists and OPTIONS4\n\n---\n[← Prev](/pages/page-189.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-191.md)\n\n# Page 191\n\n© C O RE P O W ER Y OG AWHY DO WE ASSIST?Assisting is a powerful way to connect and an efficient way to deliver information. Hands off and hands on assists provide i nformation for a student that they might not receive otherwise and can move their practice forward quic kly.WHAT DOES IT MEAN TO ASSIST IN PRACTICE?Assists support the student in learning something new in their practice. The learning might be through a visualdemonstration, a verbalinstruction or varying degreesof a physical touch assists from directional to deepening.THE GOAL To benefit others by supporting their evolution, understanding and execution of their yogapractice.THE IMPORTANCE OF TOUCH Psychology TodayOn May 28, 2024, a new article in Psychology Today sharethe meta-analysis research on the power of touch. As Polish psychologist Angieszka Sorokowska and colleagues found the following:- Touch is important for infant development as well asadult communication and well-being.- Touch deprivation is linked to a host of negative mentalhealth and behavioral outcomes.- Touch interventions are effective for improving bothphysical and mental health.The results revealed overall that touch interventions havethe largest benefits for anxiety, depression, fatigue andpain.NIH On May 26, 2020, the National Institute of Health posted an article on the research of A. Heatley Tejada, et al. on physical contact and loneliness. The study found that the people receiving physical touch on a consistent basis reported lower levels of loneliness from studies going back to 2006.The\n",
  "chapter": "Postures",
  "slug": "surrender-series",
  "summary": "1:53 - 2:00Transition“Draw your knees into your chest, Roll up to a seat, Extend your legs with a slight bend in your knees, Inhale...”ExhaleSeated Forward Fold - Paschimottanasana…"
}