{
  "page_number": 1,
  "title": "Welcome & Program Overview",
  "content": "## Welcome\n\nWelcome to your YogaFlow Teacher Training journey—a powerful path of self-discovery, deep practice, and learning to guide others. This manual is your field guide. Carry it, annotate it, and let it inspire new insights. You are now part of the YogaFlow teaching community; we're excited to support your growth and transformation.\n\n## Program Commitments\n\n### Our Commitment\n\nYogaFlow provides an exceptional, practical teacher-training program aligned with international yoga standards. With successful completion and optional registration with a recognized yoga alliance, you'll be qualified to share yoga professionally.\n\n### Your Commitment\n\n* **Svādhyāya** (self-study): explore and refine body, breath, and mind.\n* **Aparigraha** (non-attachment): stay open to change and new directions.\n* **Tapas** (discipline): challenge yourself physically and mentally.\n* **Satya** & **Ahimsā** (truth & non-harming): offer feedback and interact with integrity.\n* **Brahmacharya**, **Śaucha**, **Santosha** (moderation, clarity, contentment): maintain balance and care throughout training.\n\n> You'll get out of this journey exactly what you put into it.\n\n## TT Intention & Methodology\n\nThe intention of YogaFlow Teacher Training is to strengthen your personal practice, equip you to teach confidently and safely, and inspire transformation in yourself and your students.\n\n* Foundational sequencing (C1) in the first half of training.\n* Advanced sequencing, theming, and customization in the second half.\n* Lectures in anatomy, yoga philosophy, and inclusive teaching.\n* Practice teaching and group discussions for real-world skills.\n\nWhether or not you teach professionally, these skills influence how you think, connect, and navigate daily life.\n\n## Setup for Success\n\n* Embrace learning and participate actively.\n* Practice more days than you don't.\n* Learn and use names; speak kindly and only when necessary.\n* Use inclusive language (\"team,\" \"everyone,\" \"friends\").\n* Share when it adds value; keep a growth mindset.\n\n## Journals & Quizzes\n\nJournaling every practice and lecture is part of svādhyāya and supports certification. Reflect on how your body felt, what you learned about sequencing and cueing, effective demonstrations, adjustments, theming, and at least one takeaway from each class.\n\n## Reading & Resources (Optional)\n\n* *Light on Yoga* — B. K. S. Iyengar\n* *Yoga Sutras of Patanjali* — commentary by Swami Satchidananda\n* *Meditations from the Mat* — Rolf Gates\n* *The Four Agreements* — Don Miguel Ruiz\n* Plus other foundational yoga texts of your choice.\n",
  "chapter": "Getting Started",
  "slug": "01-welcome-and-overview",
  "summary": "An introduction to the YogaFlow Teacher Training program, including commitments, intentions, and how to set yourself up for success."
}