{
  "page_number": 25,
  "title": "Power of Assists",
  "content": "# Power of Assists\n\nHarvard Med ical SchoolOn June 13, 2023, Harvard Medical School publisheda series of articles on the benefits of human touch.They found that Oxytocin can be released through touch, music and exercise. Oxytocin is a hormone that’s produced in the hypothalamus andreleased into the bloodstream by the pituitary gland. Oxytocin has been shown to decrease stress and anxiety levels.IMPORTANCE OF CONSENT TO TOUCHA SSUME OPTE D OU TAlways ask people to share their preference ontouch. Empowering yourstudents to share ifthey want to be touched with tokens or averbal/hand raise at the beginning of class is optimal. Assume people have opted out. If you haven’ t asked at the beginning of class, or ifyou have forgotten without the aid of token,ask before you touch. When in doubt, use ademonstration or a verbal assist to get theinformation a cross and then make a connectionafter class to offer the assist then.NON-PHYSICAL TOUCH ASSISTS Verb al/ Direction al/ Demo ns trationsThese assists can be done at any time andprovide powerful insights for students. You can point to an area on your own body,demonstrate a range of motions or postures.You can use your voice to bring awareness to a specific movement for the group or anindividual and that creates a mentalconnection.AVOID FORCING FLEXIBILITYW hy we rec om mend d e p th as s is ts rarelySports Medic in e M. D. Nathan Yokel presentedin an interview on August 25 , 2017, that“forcing a stretch, and worse having someoneelse force it on you, is asking for an injury that could do permanent damage. And while pain is one way of gauging the limits of our flexibility, it isn’t always the perfect guide because someareas have more sensation than other. Muscleshave more and tendons and ligamentshaveless. You might not necessarily feel it in thatmoment. Slow, static holds with breath overtime will move you to your optimum stateof flexibility.”4. 2\n\n---\n[← Prev](/pages/page-190.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-192.md)\n\n# Page 192\n\n© Yoga Flow YOGA TYPES OF ASSISTS1.Verbal–verbal cues such as general form cues or muscle action cues 2.Directional–language that refers to landmarks in the room or space or using gestures to highlight areas of the student’s mat 3.Physical–hands on touch that supports their Form, Balanced Muscle Action and Student Directed Depth4.Demo–poses that you as a teacher will show in the front or sides of the room Honor that trust by knowing what you want to accomplish with themand:- Be mindful of your own alignment and safety while assisting.- Enterthestudent’sspacewithconfidenceand anintentionofkindness.- Makeaneffort to toucheveryoneinclass.- Assistthosewhoneedthemosthelpfirst.- Assistinawaythatcreatessupportand stabilityforthe student.\n",
  "chapter": "Assists and Options",
  "slug": "power-of-assists",
  "summary": "Harvard Med ical SchoolOn June 13, 2023, Harvard Medical School publisheda series of articles on the benefits of human touch.They found that Oxytocin can be released through touch,…"
}