{
  "page_number": 11,
  "title": "Demos",
  "content": "# Demos\n\nare required for Chaturanga, Boat Pose and Crow Pose.DEMO WHILE TEACHING Demo the pose while your students are alsoperforming the pose. Use general form cues toguide your students into a particular posture. As you do so, make your way toward the side of the room in which your students will face. Mirror your students and physically move into the postureyourself. It’s essential to move to the place inthe classroom that offers students the best view and remember you will be doing the pose on the opposite side. Use this option when students willbe in a pose for several breaths and when it’s safe for your students to look without straining theirneck or shoulders.In a C1, optional demos while teaching include Warrior Two, Extended Side Angle, ReverseWarrior, Revolved Crescent Lunge, Warrior One, Half Pigeon and Camel.CHATURANGA Ask your students to come to their knees andwatch the demonstration. Chaturanga is physically demanding pose so encourage your students tomodify as they need throughout their practice. Give them all three options during your demo.Start with High Plank Pose. From a Halfway Lift,plant your hands on the mat and step back to High Plank. Walk them through the ground up cues toproperly get into High Plank Pose.Next, explain moving from High to Low Plank.From High Plank Pose, shift forward and bendyour elbows up to 90 degrees. Walk them through the ground up cues to properly get into Low Plank Pose. Let students know that shifting your body forward is crucial to maintaining the optimalalignment from High Plank to Low Chaturanga and achieving a 90 degree angle at your elbows andwrists. Also emphasize bringing weight into thefront triad of the palm (the first finger and thumb) to relieve pressure in the back of the palm at thewrist.Then move into Upward Facing Dog. FromChaturanga, turn the tops of your feet down and straighten your arms. Walk them through ground up cues here.Finally move to Downward Facing Dog. FromUpward Facing Dog, flip or curl your toes under,push into your hands, engage your abdominals and send your hips up and back.Stand back up and explain that a second optionin Chaturanga is to drop to your knees for High to Low Plank. Switch directions so that students can see you from a new angle. Now move through HighDemos\n\n---\n[← Prev](/pages/page-034.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-036.md)\n\n# Page 36\n\n2 .15© Yoga Flow YOGA Plank, High to Low Plank on your knees, Upward Facing Dog and Downward Facing Dog.Finally, let them know that a third is to hold High Plank and then press directly back to Downward Facing Dog. You do not need to physically demothis option.BOAT POSE From Bicycle Sit-ups, ask your students to roll up to seated with knees bent and feet flat on theground. Recommended location is in the front of the room facing your students so they can seeyou and you can see their alignment while you cue them into layers of the pose. This is a demo where they work with you into the pose as you cue. You will give options for layers in this pose so people can choose which layer is best for them to playtheir edge while maintaining a long spine. Thistrains the fundamental muscle actions in the whole wall of core muscles in this pose.Keep your feet on the ground and bring your hands behind your thighs. Lengthen your spine as youdraw your shoulder blades together down yourback. Cue them through this as you demonstrate. Give them the option to stay here or keep following you. Lean back while you maintain a long spineand lift your feet up to bring your shins parallel to the floor. Again, give them the option to stayhere or continue with you. Extend your arms out to the side. Once you have held the pose for a breath or two, you can come out of the pose and movearound the room again.CROW POSE From Downward Facing Dog, ask your students to come to their knees and watch the demonstration or if they are familiar with Crow Pose, to moveinto the pose. Crow Pose is a physically demanding and sometimes intimidating pose. Encourage your students to try it in steps; even shifting the weightforward into their hands is very empoweringEmphasize bringing weight into the front triad of the palm (where the first finger inserts into the palm) to relieve pressure in the back of the palm at the wrist. The shift forward and squeezing ofthe inner thighs into the upper arms bolsters core strength and provides elevation.WARRIOR TWO Reiterate the importance of keeping the frontknee stacked directly over the front ankle. It is also important to explain the engagement of the backleg. Direct students to point their foot slightlyforward and engage through their back quadricep.You can also help students identify the position of their upper body and direct them to bring their shoulders directly over their hips. It can be helpful to show your students the extremes (too farforward or too far back) and then end with a visual of a properly aligned torso.EXTENDED SIDE ANGLE Acknowledge the fact that the foundation ofExtended Side Angle is the same as Warrior Two.Emphasize the importance of keeping the frontknee stacked over the ankle and the engagement of the back leg. Additionally, draw attentionto ways in which students can adjust commonLOOK FOR . Show your students what it means to lift your ribs away from your front thigh andto keep the bottom shoulder drawn down. It’s isalso helpful to address the placement of the front arm/hand. Let your students know that it is more important to maintain a long torso than to touch the floor with their front hand. Give your students permission to bring their forearm to their thigh as a great option and show them what this looks like.REVERSE WARRIOR Like Warrior Two and Extended Side Angle, the foundation for this pose remains the same. While the upper body shifts, remind your students to\n\n---\n[← Prev](/pages/page-035.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-037.md)\n\n# Page 37\n\n2 .16continually bend their front leg. A big focal point for Reverse Warrior is the orientation of the chest. Rather than opening the chest upward, emphasize the importance of keeping the chest lifted andside facing. Another great teaching point is to reference the back shoulder and arm. Encourageyour students to draw the back shoulder down and keep minimal weight in the back hand.REVOLVED CRESCENT LUNGE Emphasize the importance of a strong foundation to support the twist. To stabilize their foundation, encourage students to draw their inner thighs toward one another. Additionally, give thempermission to bring their back knee to themat as another option (this is a great thing to demonstrate to your students so they feel safeand supported in taking a different option). From there, explain how students can leverage theconnection of their bottom elbow and thigh to lift and twist through their torso. Empower them to take whichever version is most accessible to them and be sure to speak positively to all options, astwisting postures can be very challenging.WARRIOR ONE With your students in Downward Facing Dog, verbally cue them into Warrior One. Position yourself at the front of the room and assumeWarrior One stance on the same side your students are on.HALF PIGEON With your students in Downward Facing Dog, verbally cue them into Half Pigeon. Positionyourself at the front of the room and assume Half Pigeon on the same side your students are on.This posture can be very challenging for students with tight hips. For this reason, we give students 3 breaths to keep their torso upright. Then we givethem 3 breaths to fold forward. You may also want to call attention to their back foot and remindyour students to point their back foot straightback. You can exemplify the importance of a lifted, lengthened chest and give them a visual of theplacement of the front knee.CAMEL From all fours, invite students to stand on their knees with their torso upright. Position yourselfat the front of the room. Emphasize the lift of the chest in this posture rather than the bend in thelow back. Hand placement is also important topoint out so the students are fully support as they move into this spine strengthener. Give students a starting point and let them know that they might just look up toward the ceiling and that looking up and back isn’t necessarily better. Reassure themthat physical sensation in this posture is very normal and that they can release at any time.\n\n---\n[← Prev](/pages/page-036.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-038.md)\n\n# Page 38\n\n2.18© Yoga Flow YOGA\n",
  "chapter": "Teacher Toolkit",
  "slug": "demos",
  "summary": "are required for Chaturanga, Boat Pose and Crow Pose.DEMO WHILE TEACHING Demo the pose while your students are alsoperforming the pose. Use general form cues toguide your students …"
}