{
  "page_number": 3,
  "title": "Journaling",
  "content": "# Journaling\n\nJournaling is a powerful tool for self-discovery, integration, and growth throughout your yoga teacher training and beyond. This practice helps you process experiences, track progress, and deepen your understanding of yoga's teachings.\n\n## Why Journal in Yoga Teacher Training?\n\n### Self-Reflection\nJournaling creates space for honest self-examination:\n\n- **Track your growth**: Document changes in your practice and understanding\n- **Process emotions**: Work through challenges and breakthroughs\n- **Clarify intentions**: Keep returning to your deeper \"why\"\n- **Identify patterns**: Notice recurring themes and insights\n\n### Integration\nWriting helps integrate learning:\n\n- **Connect theory to practice**: Bridge philosophical concepts with lived experience\n- **Synthesize information**: Combine multiple learning sources into personal understanding\n- **Retain knowledge**: Writing reinforces memory and comprehension\n- **Make it personal**: Relate teachings to your unique journey\n\n### Teaching Preparation\nJournaling develops teaching skills:\n\n- **Find your voice**: Develop authentic expression and teaching style\n- **Create content**: Generate ideas for classes, themes, and sequences\n- **Practice articulation**: Learn to express complex concepts clearly\n- **Build confidence**: Document your growing expertise and insights\n\n## What to Journal About\n\n### Daily Practice Observations\nRecord details about your physical practice:\n\n- **Physical sensations**: How poses feel in your body\n- **Breath awareness**: Quality and rhythm of breathing\n- **Energy levels**: Before, during, and after practice\n- **Emotional states**: Feelings that arise during practice\n- **Challenging poses**: Areas needing attention or growth\n- **Breakthrough moments**: Times of ease, strength, or insight\n\n### Learning Insights\nCapture key learnings from training:\n\n- **New concepts**: Philosophical or technical ideas that resonate\n- **Questions arising**: Topics you want to explore further\n- **Connections made**: How different teachings relate to each other\n- **Personal relevance**: How teachings apply to your life\n- **Teaching applications**: How you might share these concepts\n\n### Teaching Experiences\nIf you begin teaching during training:\n\n- **Class preparation**: Intentions, themes, and sequences planned\n- **Student observations**: How students respond to different approaches\n- **Teaching challenges**: Areas where you struggled or learned\n- **Successful moments**: What worked well and why\n- **Adjustments made**: How you adapted in real-time\n\n### Personal Growth\nDocument your broader development:\n\n- **Mindset shifts**: Changes in perspective or understanding\n- **Relationship changes**: How yoga affects your connections with others\n- **Life applications**: Ways yoga philosophy influences daily decisions\n- **Spiritual experiences**: Moments of connection or transcendence\n- **Challenges overcome**: Personal obstacles you've worked through\n\n## Journaling Techniques\n\n### Free Writing\nWrite continuously without stopping:\n\n- **Set a timer** for 10-20 minutes\n- **Don't edit** or censor yourself\n- **Keep writing** even if you repeat yourself\n- **Ignore grammar** and focus on flow\n- **Let thoughts emerge** naturally\n\n### Prompted Writing\nUse specific questions to guide reflection:\n\n- *What did I learn about myself today?*\n- *How is my relationship with my body changing?*\n- *What teachings resonated most deeply this week?*\n- *Where do I still feel resistance or struggle?*\n- *How has my understanding of yoga evolved?*\n\n### Stream of Consciousness\nAllow thoughts to flow without structure:\n\n- **Start with whatever comes to mind**\n- **Follow thought threads** wherever they lead\n- **Don't worry about coherence**\n- **Trust the process** of unconscious expression\n- **Look for patterns** after writing\n\n### Letter Writing\nWrite letters to yourself or others:\n\n- **To your future self**: Share current insights and hopes\n- **To your past self**: Offer compassion and wisdom\n- **To a mentor**: Express gratitude or ask for guidance\n- **To students**: Practice explaining concepts clearly\n- **To challenges**: Address difficulties directly\n\n## Creating a Journaling Practice\n\n### Establish Routine\nConsistency enhances the benefits:\n\n- **Same time daily**: Link to existing habits like morning coffee\n- **Same location**: Create a dedicated, peaceful space\n- **Same duration**: Start with 10 minutes and build gradually\n- **Same format**: Use the same notebook and pen for consistency\n- **Regular review**: Read past entries to track growth\n\n### Choose Your Tools\nFind what supports your practice:\n\n- **Physical journal**: Many prefer the tactile experience of pen and paper\n- **Digital platforms**: Apps like Day One or simple documents work well\n- **Audio recording**: Speak your reflections if writing feels challenging\n- **Art journaling**: Combine writing with drawing or collaging\n- **Combination approach**: Use different methods for different purposes\n\n### Overcome Common Obstacles\nAddress challenges that might arise:\n\n- **\"I don't know what to write\"**: Start with physical sensations or breath\n- **\"I don't have time\"**: Even 5 minutes provides value\n- **\"It feels silly\"**: Remember this is private and for your growth\n- **\"I'm not a writer\"**: Focus on honesty, not literary quality\n- **\"I might judge myself\"**: Practice self-compassion and curiosity\n\n## Journal Prompts for Teacher Training\n\n### Week 1-4: Foundation Building\n- What drew me to yoga teacher training?\n- How does it feel to be a beginner again?\n- What fears or expectations do I carry?\n- How is my body responding to increased practice?\n\n### Week 5-8: Deepening Understanding\n- Which philosophical concepts challenge me most?\n- How are the yamas and niyamas showing up in my life?\n- What have I learned about breath and energy?\n- How is my understanding of alignment evolving?\n\n### Week 9-12: Finding Your Voice\n- What kind of teacher do I want to become?\n- How do I want to share yoga with others?\n- What unique gifts do I bring to teaching?\n- How has this training changed my personal practice?\n\n### Week 13-16: Integration and Planning\n- How will I continue learning after training ends?\n- What aspects of yoga am I most excited to share?\n- How has my relationship with myself changed?\n- What legacy do I want to create as a teacher?\n\n## The Power of Review\n\n### Regular Reflection\nLook back at your entries regularly:\n\n- **Weekly reviews**: Notice patterns and progress\n- **Monthly assessments**: Evaluate growth and set new intentions\n- **Milestone celebrations**: Acknowledge achievements and breakthroughs\n- **Challenge analysis**: Learn from difficult periods\n\n### Graduation Review\nAt the end of training:\n\n- **Read your first entry**: Notice how much you've grown\n- **Identify key themes**: What patterns emerged throughout?\n- **Extract wisdom**: What insights will guide your teaching?\n- **Plan continuation**: How will journaling support your ongoing development?\n\n## Beyond Training\n\nContinue journaling as you begin teaching:\n\n- **Teaching reflections**: Process each class you lead\n- **Student interactions**: Learn from challenging or inspiring moments\n- **Continuing education**: Integrate new learning into your practice\n- **Personal evolution**: Track how teaching deepens your understanding\n\n## Final Thoughts\n\nJournaling is not about perfect prose or profound insights. It's about showing up honestly with yourself, creating space for reflection, and documenting your unique journey through yoga. Your journal becomes a treasure trove of wisdom, growth, and transformation—a companion for life.\n\nRemember: There's no wrong way to journal. Trust your instincts, be patient with the process, and allow your practice to evolve naturally.\n\n*The pen is your teacher, the page is your student, and the words are your practice.*\n\n# Page 9\n\nThis document containsconfidential or proprietary information owned byYoga Flow Yoga, LLC.Reproduction and/or disclosure through any means is prohibited without the express, written consent of an authorized representative of Yoga Flow Yoga.\n\n---\n[← Prev](/pages/page-008.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-010.md)\n\n# Page 10\n\nProgram CommitmentOUR COMMITMENT Yoga Flow Yoga is committed to providing you with an exceptional and practical teacher training program that followsthe standards of Yoga Alliance. With the completion of your certification requirements and an optional Yoga Alliance Registration you will be qualified to market yourself as a yoga teacher in the greater yoga community. We will teach you to become a dynamic teacher, while at the same time giving you the opportunity to explore and discover the power within yourself. We are committed to educating you on how to understand yoga and teach yoga asana. In order toreceive your certificationyou must meet all teacher training requirements.If you would like to continue your yoga education with Yoga Flow Yoga following graduation, you have the option of enrolling in our Extensions Program.YOUR COMMITMENTI commit to this program and Svādhyāyaself-study in both mind and body. I am committed to the process of growth through Aparigrahaor non-attachment and am open to exploring the many new directions that this teacher training will take me. I will challenge my current physical abilities in the pursuit of elevating my asana practice and will practice Tapas or self-discipline while seeking knowledge of the body and its movements. I will practice Asteyaor non-stealing and will be on time and present in mind and body for lectures. I will let my teacher training lead, coach, and peers know in advance when I cannot attend. I will continue to support my own growth as well as the growth of the Yoga Flow Yoga community. I will practice Satya or truth and Ahimsāor non-judgment/non-harming in my feedback and in group discussion. I will practice Brahmacharya, moderation, Śaucha, clarity, and Santosha,contentment, in the pursuit of my goals. I acknowledge that the schedule is demandingand I will practice self-care throughout the program duration. I realize that this contract is solely with meand I will have no attachment to the outcome. I will be committed to the journey and my growth that will unfold in the process. I will get out of this training exactly what I put into it.CERTIFICATION REQUIREMENTS You will receive your Yoga Flow Yoga 200 Hour Certificate upon completion of the following.- Attend all required Power Yoga 200hr Teacher Training sessions and complete all self-paced pre-recorded content- Meet minimum attendance requirement and make-up work- Complete all post-session, post-lecture journal and quizzes in Yoga Flow University (YFU)- Attend and journal about 50 asanas practices, including 2 outside classes and at least 1 each of C1, C2, YS, HPF and CR- Complete final exam- Complete online program survey- Tuition paid in full\n\n---\n[← Prev](/pages/page-009.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-011.md)\n\n# Page 11\n\n1.Whyare youattendingthis training? 2.Whatare threethingsyou hopetoachieveduringthis training? 3.Whatdoyouthinkwillbe themostchallengingpartof training? 4.Howdoyouthinkthis trainingwillchangeyour life? 5.Whatisyoga toyou? Consideringthatyoga means “union”or“connection,”how wouldyoudescribewhatwe are connectingourselvesto?\n\n---\n[← Prev](/pages/page-010.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-012.md)\n\n# Training1\n\nTraining1\n\n---\n[← Prev](/pages/page-011.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-013.md)\n\n# Page 13\n\n---\n[← Prev](/pages/page-012.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-014.md)\n\n# Page 14\n\nTT IntentionThe intention of Yoga Flow Yoga Teacher Training is to take you on an inner journey of self-discovery, to strengthen your personal yoga practice andto share with you the skills to teach yoga and transform the lives of others.Our teaching methodology focuses on practical experience to drive accelerated results during this training. Get ready to dive in headfirst! We use a formulaic approach to teaching that translates to accessible learning for you now and for your students in the future. We’ll primarily study our foundationalC1 sequence for the first half and learn more about sequencing beyond in the second half-you’ll learn Yoga Asana, an Accessible Approach to customizing poses, and Teaching Tools like sequencing and theming. We’ll explore lectures in Anatomy, Yoga History, Yogic Philosophy and inclusive teaching tools. We’ll spend time in lecture, group discussion, workshops and of course, plenty of practice teaching!Whether you decide to actually teach yoga or not, we are all lifelong teachers. Cultivating these life skills and observing the many other life lessonsof yoga will heavily influence your life beyond your yoga asana practice, changing how you navigate situations, think, interact and connect with the world around you.Let’s nurturethe physical, mental and spiritual health that come from a consistent yoga practice.\n\n---\n[← Prev](/pages/page-013.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-015.md)\n\n# Page 15\n\nsetup for SuccessEMBRACE the new learning opportunities and be an active participant.PRACTICE more days than you don’tLEAR Nand use namesSPEAK to the group with kindness and only when necessaryCHOOSE gender-inclusive language ”Team, everyone, friends”SHARE only after you’ve discerned what you are sharing is needed nowHave a GROWTH MINDSET- A teacher exists in everyone and everything- Become humble and learn from yourself- You are your best teacher- Take what works and leave the rest- What you put in is what you get outfeedbackYoga Flow Yoga thrives on feedback because it’s how we learn and grow as teachers,students, and people. Feedback is intendedto create positive change without negativity or criticism. Feedback can offer a new ordifferent perspective.GIVING- Lead with gratitude and name- Be clear with your intention- Offer specific observations- Ask questionsRECEIVING- Listen- Be Open to new perspectives- Ask questions- Use feedback as a gateway for larger conversations- Share gratitude\n\n---\n[← Prev](/pages/page-014.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-016.md)\n\n# Class Journals\n\n1 .4 © Yoga Flow YOGA Quiz and JournalsDuring training, as part of your requirements you are expected to journal about every yoga practice, lecture and sessionin Yoga Flow University (YFU). Journaling is a great way to extend the classroom experience.Reflecting on your yoga practice will allow you to see how it relates to the content of your training.Journaling is part of Svadhyaya (self-study) and is required to complete your certification.You will journal about each class where youpractice, each class you observe, each outside class and each large group lecture or classroom session. Keep a running class count and you have unlimited yoga during the program. We encourage you to start on these requirements as soon as you can. The following are examples of your journal entries for both yoga practices and large group sessions.JOURNAL TIPS- Reflect on your overall experience. How do you feel? What did you learn about your practice? What new things did you learn about guiding a class effectively?- How did the instructor use energy, voice, their playlist or the environment (light, music, heat if applicable) to support their class?- What cues were effective and why?- What did the teacher speak to outside of the physical aspects of yoga (theme)? - What is at least one learning you are taking away from this class experience?- How did your teacher weave their theme into class? - Didyoureceiveanyadjustments?Whatdidthey helpyoulearn?- DescribetheInstructor’sdemonstrations.Whatwaseffective?Wasanythinglessthan effectiveor missedthemarkaccordingtoyour observation?\nClass Journals\n\n---\n[← Prev](/pages/page-015.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-017.md)\n\n# Page 17\n\n1 .5 © Yoga Flow YOGA Do the best you can to cover the material but be patient with yourself as these terms and concepts begin to soak in. Remember yoga is a lifelongpractice.Review the posture breakdowns for allpostures. Pay special attention to the key points of alignment, OPTIONS and benefits of each posture.Review your notes and handouts from each session including the Philosophy, Anatomy,Contraindications and Pregnancy and Business of Yoga lectures as well as the hands-on Assistssessions.Understand the 10\n",
  "chapter": "Training",
  "slug": "journaling",
  "summary": "and YFU Final Exam Guide Grad Reqsand Reading RecosBusiness of Yoga Yoga Alliance 3.23.153.233.273.41C1 SequenceIntegration Series Intention SeriesSun Salutation A Sun Salutation B…"
}