{
  "page_number": 38,
  "title": "Breath",
  "content": "# Breath\n\nANATOMY OF BREATH Diaphragm ADome shaped muscle that divides ribs fromabdomen horizontally through the center of the body. The diaphragm pulls down to create more space in the lung cavity during an inhalation.Intercostal MusclesThese are located in the thorax or ribcage. Pull the ribs further apart for more air during an inhalation and squeeze the ribs together to push air out onforced exhalation.Oblique MusclesContracts during forced exhalation (cough, sneeze, laugh).Serratus Posterior BHelps pull ribs out of the way to create more space during an inhalation.Scalenes and Sternocleidomastoid (SCM)Pull the top ribs out of the way for upper chest breathing.EXERCISE AND GUIDED BREATH Breath takes place in three parts of the body. Because of the size and volume capacity of our lungs, a full breath should involve movement inall three areas and all three dimensions (front to back, side to side, top to bottom).- Diaphragm, stomach, and lower back body (front to back)- Clavicle (up and down)- Chest and ribs (side to side and all directions)Inhalation- Diaphragm moves downward, increasing lung volume- Intercostals muscles move the ribs apart from each other- Scalene and SCM move the top ribsExhalation- Diaphragm relaxes and returns upward expelling air out- The elasticity of the lung tissue aids in expelling air- The ribs relax and reduce the volume, thus air is forced outForced Exhalation- The intercostals pull the ribs closer togetherforcing air out (cough and feel the muscles work)- The abdominals assist in forcing air out of the lungs\nA\nB\n\n---\n[← Prev](/pages/page-240.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-242.md)\n\n# Page 242\n\n5.25 Verbal CueDesired AdjustmentYOGABREATHING- Different styles of yogic breathing have different intentions- Some yogic breath patterns help to increase lung capacity- Some yogic breath patterns form undulations in the chest and belly to massage the organs- Abdominal breath can focus on expanding/ softening the belly and abdominal floor,activating the parasympathetic nervous system to calm the mind and body- Chest breathing can open the heart, wake up the intercostals and neck muscles and help correctpoor postureWhat are some anatomical cues or “yoga vernacular” youhave heard instructors use during your yoga practice? What was the cue and what do you think was the desired anatomical response?\n\n---\n[← Prev](/pages/page-241.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-243.md)\n\n# Page 243\n\n---\n[← Prev](/pages/page-242.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-244.md)\n\n# Page 244\n\n---\n[← Prev](/pages/page-243.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-245.md)\n\n# Page 245\n\n---\n[← Prev](/pages/page-244.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-246.md)\n\n# Page 246\n\nHistory and Philosophy6\n\n---\n[← Prev](/pages/page-245.md) &nbsp; [Top](/index.md) &nbsp; [Next →](/pages/page-247.md)\n\n# Page 247\n",
  "chapter": "Anatomy",
  "slug": "breath",
  "summary": "ANATOMY OF BREATH Diaphragm ADome shaped muscle that divides ribs fromabdomen horizontally through the center of the body. The diaphragm pulls down to create more space in the lung…"
}